[{"reviewerID": "A259V3746XH1RF", "asin": "B00IJKZY4A", "reviewerName": "edgar christensen", "helpful": [0, 0], "reviewText": "great show, hope all the episodes are this good, first 3 so far yes. a worthy successor to original with carl sagan. the fx and animation with  neal tyson degrasse hosting are great.. explains some science and history of science understandably and eloquently. instant emmy worthy classic. neal Tyson degrasse is fabulous.", "overall": 5.0, "summary": "wonderful journey.", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"},
{"reviewerID": "A2ZT9K1PFBZ1L9", "asin": "B00IJKZY4A", "reviewerName": "Gerald G.", "helpful": [1, 2], "reviewText": "The show is bringing science to the people, written so almost everyone can understand it. Have this shown to students either in schools or as required viewing at home, so they get a basic understanding of how we got here and how the universe works. These are concepts that everyone should know, especially when they grow up to become voters of the future. Great job!", "overall": 5.0, "summary": "the new COSMOS", "unixReviewTime": 1399852800, "reviewTime": "05 12, 2014"},
{"reviewerID": "ACNMIB4EHVQSY", "asin": "B00IJKZY4A", "reviewerName": "Huns", "helpful": [18, 23], "reviewText": "I LOVE the original Cosmos that Carl Sagan did back when everyone was wearing socks with stripes on the top. Neil Tyson is Sagan's spiritual successor, as far as I and many others are concerned, so there's really no one else on the whole planet better suited to do this show. The content itself is beyond reproach. Tyson is the perfect lecturer, the content mirrors the original to some extent, and the CGI is very, very good. It's only been one episode, but I can tell they put some serious effort into it.Fox, there is a PERFECT way to do house ads in paid content. PUT THEM AFTER OR DURING THE CREDITS!!! That way, they will still be seen, but they will not interrupt the user experience with the same loud offensive schlock that is DRIVING US AWAY FROM TELEVISION IN THE FIRST PLACE.", "overall": 3.0, "summary": "Would be SIX stars, but then FOX spams you with the commercials you paid NOT to have to watch!!!", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"},
{"reviewerID": "ANFQPAT5AOMCS", "asin": "B00IJKZY4A", "reviewerName": "J. Hedgepeth", "helpful": [3, 5], "reviewText": "Cosmos was before my time, but I had heard of it for the longest time. I finally got around to watching it over the summer. I was amazed. It was the best science documentary I had ever seen. The presentation, the writing, the score, EVERYTHING!Sure, the effects were outdated, but that shouldn't keep someone from being able to appreciate it for the spectacular series that it was.I look forward to the remake. We have the genius of Ann Druyan to help bring back the amazing touch that existed in the original, and we have NDT to present it to us. I can't imagine a better duo.I look forward to this and to the magnificent special effects that we will get to enjoy this time around!Spread the word, Cosmos is back!!!!!!", "overall": 5.0, "summary": "If you wish to make an apple pie from scratch, you must first invent the universe.", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"},
{"reviewerID": "A10L7F2V8368DO", "asin": "B00IJKZY4A", "reviewerName": "Jorge", "helpful": [4, 15], "reviewText": "Okay...some nice pictures, some nice information, but for the most part this is really a series for children or the cosmically deficient.  Totally not impressed.", "overall": 2.0, "summary": "Subtitle should read 'Cosmos for Dummies'", "unixReviewTime": 1396051200, "reviewTime": "03 29, 2014"},
{"reviewerID": "A32IDF7JFAPXAG", "asin": "B00IJKZY4A", "reviewerName": "Joshua Glowzinski \"Gman\"", "helpful": [2, 2], "reviewText": "Wow, this is an amazing show.  I get such an odd feeling when I watch this.  Like the guy is talking to me and only me.  Like I am sitting inside of a dome with a screen covering the entire thing.  I am 29, never before have I felt like that.  I love science.  I am so interested in this show.  My mind was blown on the episode I watched last night.  Talking about how light travels at the same speed, no matter what it is on.  I never thought about that before.  Amazing show.  I hope it stays on for a while.  I already pre ordered it.  You can learn, without feeling like you are being pressured.  Amazing.", "overall": 5.0, "summary": "One of the best shows I have ever seen.", "unixReviewTime": 1396224000, "reviewTime": "03 31, 2014"},
{"reviewerID": "A1A25VSVSGHBLS", "asin": "B00IJKZY4A", "reviewerName": "juicy", "helpful": [4, 12], "reviewText": "I'll try to be succinct:  1.  This isn't as good as the original, regardless of the cgi or special effects, which, btw, are cheesy and not so good - especially the graphic of Saturn (with a missing lower half of the orb) and especially the godawful spaceship.  As bad as the original spaceship was, it is better than this one.2.  Do we need 7 minutes of credits from the 'producer', 'executive producer', 'co-executive producer', 'executive co-executive associate producer', etc. etc.? I'm surprised the FOX logo isn't placed in the lower right of the screen for the entire episode - thank god it isn't. 3.  I'll wait for the complete series to come on DVD and then borrow it from the library, for free.", "overall": 2.0, "summary": "Don't believe the hype -", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"},
{"reviewerID": "A1ISQ4BFCCGKVY", "asin": "B00IJKZY4A", "reviewerName": "Keats", "helpful": [0, 0], "reviewText": "amazing show. Everyone should watch this and it should be required in schools.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"},
{"reviewerID": "A3VUULWX6R02W", "asin": "B00IJKZY4A", "reviewerName": "mary ruth", "helpful": [0, 0], "reviewText": "I believe that the new Cosmos has had a difficult time getting it's voice just right but my husband and I are beginning to love it!", "overall": 4.0, "summary": "We are beginning to enjoy Cosmos again", "unixReviewTime": 1401580800, "reviewTime": "06 1, 2014"},
{"reviewerID": "A1O5ZPBUQVNYMG", "asin": "B00IJKZY4A", "reviewerName": "Michael Christy", "helpful": [3, 3], "reviewText": "Yes, there are commercials in this series, but NOT throughout the episodes as many are telling you.  The commercials for other shows on fox are only at the very beginning, BEFORE the show starts, and only again AFTER the episode ends.  So, it is not like watching it on TV with a commercial every 10 minutes, so I do not know why people are saying what they are saying.  I too did not buy the show to watch what is coming up on FOX this season, but do not decide to stop purchasing these episodes because of the fear you have to sit through commercials throughout the whole show.  Just wanted to make it clear, since no one else was.Thank you!", "overall": 5.0, "summary": "Great show but understand something not being made clear...", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"},
{"reviewerID": "A2A1EKNXT0EQRY", "asin": "B00IJKZY4A", "reviewerName": "Mike Hunt", "helpful": [0, 0], "reviewText": "Very good series that challenges conservative faith. A wonderful blend of all the sciences. Answers many questions religion dare not approach. Educational fun and challenging.", "overall": 5.0, "summary": "Leave your faith at the door.", "unixReviewTime": 1399852800, "reviewTime": "05 12, 2014"},
{"reviewerID": "A36EKEC9C4P2QH", "asin": "B00IJKZY4A", "reviewerName": "Pania Kiranos \"Ladydragon\"", "helpful": [0, 0], "reviewText": "This is one of the few movies and/or TV shows which I've purchased in HD...... not to would be wrong!  It makes no difference whether I agree with the theory or not, this is the most visually stunning presentation, and Neil DeGrasse Tyson and his Ship of Imagination are wonderful!", "overall": 5.0, "summary": "\"Cosmos\"", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"},
{"reviewerID": "A3JNVOV0L3UI0J", "asin": "B00IJKZY4A", "reviewerName": "Peter Mancini", "helpful": [0, 0], "reviewText": "I like this series and you will to. It almost hits it for every star. It's magical like the first one was and inspiring but there are a couple things that annoy me about that put a blemish on it. In a couple of cases Mr. Tyson describes some modern science as basically universally accepted (example: string theory) but really that isn't the case and there is never a need for dogma in science anyway.The other was early on in the series the choice of who to make stars included a non-scientist martyr of the Church. Ehhhh, that left me a bit cold. The Church of Rome did a lot of really awful crap to actual scientists, why wasn't Galileo set as the prime example of what happens when forced ignorance has such power?There are many other reason to love and adore this show. Mr. Tyson is an exception presenter of science. The rest of the show is noteworthy and brilliant.", "overall": 4.0, "summary": "So close to perfect", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"},
{"reviewerID": "A2BO4AA9T3COGN", "asin": "B00IJKZY4A", "reviewerName": "Rev.Carolyn J. White", "helpful": [0, 0], "reviewText": "I love this series.  I tape every show every Sun. night.  Just missed the first one.  Watched it with my seven year old grandson and he was interested also.  Easy to understand.  How do people still believe in Creationism?", "overall": 5.0, "summary": "What I think.", "unixReviewTime": 1397865600, "reviewTime": "04 19, 2014"},
{"reviewerID": "A3RCUW441E9UZA", "asin": "B00IJKZY4A", "reviewerName": "Robert Lunte \"Author of The Four Pillars of S...", "helpful": [2, 7], "reviewText": "Please note, I have now watched all the new episodes by now and every time I have flat out fallen asleep or just turn the TVS off. The original COSMOS literally changed my life forever. This new version makes me literally snore on the couch in about 9 minutes. How could they of botched this entire series so badly? There is a great responsibility to produce this program to be amazing and its just lame. Dr. Tyson is a fun scientist but he doesn't really work in this program.  He seems nervous and speaks with a tone that makes you feel like your at a kindergarten story time reading. At times he looks like he is thinking to himself, \"... I know this is going to suck\" or \"... I don't get why we are doing this?\"... He seems uncomfortable on camera and I don't think that is because he is uncomfortable in front of a camera. I think its because he is realizing that the production and direction Fox is taking creating with him as the host... is seemingly... sucking?!  Its lacking that \"pocket\" and synergy that Sagan and his production created. With 20 years advancement in special effects and scientific knowledge... FOX can't make a space documentary that is mind blowing?  Why?.... This is COSMOS!?  How could that be allowed to happen?Why are there so many boring, cheap cartoons!  They suck! Is this because they wanted to save money on actors and effects so they went to cheap cartoon technology to get the required content for a show?  The cartoons are clearly a hint that something went wrong at the production of this show.The content also lacks cohesion. It bounces around and makes really obvious and sophomoric points, or completely fails to make a point altogether. The actual science and sense of awe we should be getting from this show is lighter then any other similar cosmology documentary. It left me saying over and over again, \"... I already knew that. Ive known that since I was 12 years old\".  The point that the milky way galaxy is really, really big and that stars are far, far away... is a point I don't need to be patronized with for an hour and $2. Tell me something that is awe inspiring?  Who wrote this script?  The script and topics they choose are just completely uninspired, back room napkin, after thoughts.One episode which was the worst, was almost entirely in the lame cartoon format and it went on and on about the guy that discovered that Lead in regular gasoline was polluting our environment. This story was told through a cheap \"Johnny Quest\" style cartoon for an hour and at the end of all this, there was no connection or point to cosmology that I could readily see.  The only episode that was inspiring and echoed the original series in beauty and script was \"Sisters of the Sun\" where they talked about stars. But here again, compared to other similar programs discussing similar topics, this was like watching the opening premise that stars are really, really hot and really, really big and really , really, far, far away over and over again.  The science has ZERO depth. The script is either written for morons or was written by morons? Why would Tyson sign off on this?Its a HUGE disappointment for COSMOS fans. Tyson is impedent as the host, the script has no cohesion, the episodes are childish, they rip you off with boring cartoon story telling to save a buck on production costs, it ends and you feel like you just ate a rice cake. It is a completely dry, uninspiring waste of time, with no flavor... its lame and a shame, Carl Sagan deserves better.", "overall": 2.0, "summary": "Lame and Shame!!  COSMOS fans, Run Like Hell!", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"},
{"reviewerID": "A2IRHIFTBMY2SM", "asin": "B00IJKZY4A", "reviewerName": "Ruth in Salt Lake City", "helpful": [0, 0], "reviewText": "Just in time for my grand children! A Carl Sagan inspired show that will keep my grand children interested in science despite or governments' lack of sufficient funding of the education and space programs in the USA. When my grand father was alive we watched Carl guide us through the Universe as the US led in the space program. He told my twin brother and I that someday we would be vacationing on the moon. Well, I doubt that would have happened but we are now truly lost &#34;Lost in Space&#34; when it comes to expanding the human presence in our universe. Carl would be disappointed....", "overall": 5.0, "summary": "Space Education Back on TV", "unixReviewTime": 1395100800, "reviewTime": "03 18, 2014"},
{"reviewerID": "A1W11AZMA4WON0", "asin": "B00IJKZY4A", "reviewerName": "Sandee R. Lowe", "helpful": [0, 0], "reviewText": "I watched Cosmos with Carl Sagan when I was a kid, I was in awe, I loved it, and I never forgot it. And now I am feeling the same way I am in awe, and I love it, and I will never forget it, thanks to Professor Tyson, this series is phenomenal,,,FIVE STARS!!!", "overall": 5.0, "summary": "COSMOS THEN,COSMOS NOW!", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A25OFMUFK6AKB3", "asin": "B00IJKZY4A", "reviewerName": "Saskia L. Cohick", "helpful": [1, 1], "reviewText": "Great show.  This is a great flashback to the original Cosmos.  I hope it does for today's children what it did for me: developed my love for science and technology.", "overall": 5.0, "summary": "Awesome show!", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "A3DA5RPUX3TRIG", "asin": "B00IJKZY4A", "reviewerName": "Stephen P.", "helpful": [0, 0], "reviewText": "I'm a huge fan of Carl Sagan and the first &#34;Cosmos&#34;, it's what inspired me to be a scientist myself.  I have to say Neil Tyson more than lives up to the legacy.  One thing I really like is that this isn't simply a rehash of the earlier series with better special effects.  While it certainly is inspired by the first series, Tyson embarks on his own path, giving some great insights into the history of science.", "overall": 5.0, "summary": "Amazing", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"},
{"reviewerID": "A3H65GBDSJRNO4", "asin": "B00IJKZY4A", "reviewerName": "Teddy and Me \"JLEE\"", "helpful": [0, 0], "reviewText": "This series is amazing! Neal deGrasse Tyson (Astrophysicist) is a fascinating presenter. I hope this series continues indefinitely. It is one of the best shows on TV currently.", "overall": 5.0, "summary": "Cosmos is awesome", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "A2UR9I3QSTN4G3", "asin": "B00IJKZY4A", "reviewerName": "Teresa Pietersen", "helpful": [2, 2], "reviewText": "Excellent remaking of a classic piece of tv. The computer graphics, animation and overall presentation are beautifully done.Neal Degrasse Tyson is an excellent choice to present this.Even if you experienced the original Cosmos with Carl Sagan, you'll enjoy this series.", "overall": 5.0, "summary": "Cosmos Remade", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "AN4I7LSWW6XAT", "asin": "B00IJKZY4A", "reviewerName": "Tunist", "helpful": [2, 3], "reviewText": "I almost bought this until I saw others talking about the ads being in the material.  Glad I didn't buy it.  to bad, I'd love to own this, but I don't want to own any commercials.", "overall": 3.0, "summary": "not rating it, just commenting on a pre-buy (almost)", "unixReviewTime": 1398470400, "reviewTime": "04 26, 2014"},
{"reviewerID": "A3EF7PUYTF057Z", "asin": "B00IJM5RO0", "reviewerName": "Gary R. Jordan", "helpful": [1, 1], "reviewText": "Boring, poor editing, not very good investigative techniques.I can see why I never heard of the show, not worth the time.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"},
{"reviewerID": "A3KUX157ZXX7EC", "asin": "B00IJM5RO0", "reviewerName": "John C Miller", "helpful": [0, 0], "reviewText": "The show is Ok not a great show of this type,  Of course the use of psychic is the first clue to the BS level I have never met one was not as phony as can be.  Of course the talk about seeing this and that but some how the camera is never pointing the right way.  It is  Ok if you are bored but not really that good The five star reviews where no doubt done by cast members or payed for. Also Luminal will react to a great many types of proteins and molds not just blood and would not show up on blood that old at all the proteins would be to degraded.", "overall": 3.0, "summary": "OK what a three dollar bill", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"},
{"reviewerID": "A1K69BBLY0NVOW", "asin": "B00IJM5RO0", "reviewerName": "nowyat", "helpful": [2, 4], "reviewText": "I bought the whole first season because it was cheaper that way but the places they visit are just tourist haunts.  It's the usual claims with the usual purported evidence.  It's right up there with watching paint dry as far as entertainment goes.  You can watch better stuff on You Tube for free, like the Dorset Ghost Investigators.  I wouldn't buy a second season of this.  It will be a slog to watch all of Season One.  Oh and the sound recording is really echo-ish and annoying.", "overall": 3.0, "summary": "I didn't find it that interesting...", "unixReviewTime": 1396051200, "reviewTime": "03 29, 2014"},
{"reviewerID": "AYBTDSZ7TF3AP", "asin": "B00IJM5RO0", "reviewerName": "rcowgirl", "helpful": [0, 0], "reviewText": "I really tried hard to watch this show, but got bored with it really quickly. I like to be on the edge of my seat when watching ghost stories or shows, but this one put me to sleep and no excitement.", "overall": 2.0, "summary": "ghost....sleep", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A271WOXSBQTC7N", "asin": "B00IJM5RO0", "reviewerName": "Shelley Danica Black \"Race it & take it!!!\"", "helpful": [0, 0], "reviewText": "It is the best ghost hunter show ever in my opinion because they don't all say &#34;Did you hear that? Did you hear that?&#34; They are quiet. They get EVIDENCE! If they don't get evidence, then they don't & they don't provoke like MOST ghost hunter shows. They are genuine!They have started their 2nd season although I haven't been able to watch any yet since I don't have cable so I'm waiting for it to come on Amazon!!!&#9786;&#9786;&#9786;&#9786;Come on Amazon!!! I need some RIP Files!!!! Please???&#9786;&#9786;&#9786;&#9786;", "overall": 5.0, "summary": "Best ghost hunter show EVER!", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"},
{"reviewerID": "ALV38J6DJVZLB", "asin": "B00IJNKQHM", "reviewerName": "Annette Cavanagh \"coffee fan\"", "helpful": [0, 0], "reviewText": "From the start of the series I was intrigued by the story line and characters who themselves have complicatedhistories.  There is a whole lot of hurt and suffering and at times difficult to watch because of all the trauma  The writing is  sometimes not crisp and this adds to the burden at times..  The series is interesting but sad.The entertainment value of the series is the intricate plot line coupled with some good acting but any viewer should be aware that the content of the story is not all that pleasant.", "overall": 3.0, "summary": "Complex story line about serial killers", "unixReviewTime": 1400371200, "reviewTime": "05 18, 2014"},
{"reviewerID": "A14AZICA6QKR22", "asin": "B00IJNKQHM", "reviewerName": "carolG", "helpful": [0, 2], "reviewText": "Just disn't have anything new to offer other than the fact that the main character is a &#34;cutter&#34; which made her just a bit more interesting. Ireally like The lead actress.", "overall": 1.0, "summary": "too bad", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"},
{"reviewerID": "A29YRGL89TAGRB", "asin": "B00IJNKQHM", "reviewerName": "David Whiting \"NYCityfool\"", "helpful": [0, 0], "reviewText": "This show has room to expand, room to grow. Chlo Sevigny plays her character with the right amount of emotion without overly displaying her dark secrets. A fan of her work, this is the sort of role at which she excels. Just wish Amazon would put up the latest episode and keep the interest level going. Has the feel of a solid long run production. More, please.", "overall": 5.0, "summary": "Lots of potential", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"},
{"reviewerID": "A2ROOZV6WVVM75", "asin": "B00IJNKQHM", "reviewerName": "Dona L. Sears \"searsgig\"", "helpful": [0, 0], "reviewText": "gripping!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"},
{"reviewerID": "A2WVMOZ9XUGK4I", "asin": "B00IJNKQHM", "reviewerName": "D. Tinsley", "helpful": [0, 0], "reviewText": "What only 2 episodes and it's gone. Is it gone for good. I didn't love it like Hannibal or Blacklist but it wa growing on me. Just wish what's happening to the series would be noted on the site where we order it.", "overall": 4.0, "summary": "Where did it go?", "unixReviewTime": 1398988800, "reviewTime": "05 2, 2014"},
{"reviewerID": "AZX26WCIS8CNE", "asin": "B00IJNKQHM", "reviewerName": "E J Peak", "helpful": [0, 0], "reviewText": "I laoved this crazy actress in Big Love, she has a commending stare, but in this she is far more believable. It's a terrific story and builds to a climax nicely.", "overall": 5.0, "summary": "Chloe at her best.", "unixReviewTime": 1398211200, "reviewTime": "04 23, 2014"},
{"reviewerID": "A3FBW25GCSBON9", "asin": "B00IJNKQHM", "reviewerName": "Isaac Kirzner \"Retired But Active\"", "helpful": [1, 4], "reviewText": "Although showing excellent production values and acting, I found this series disappointing. It seems to be edging away from the detective thriller mode into the horror-macabre mode, with scenes added for the benefit of masochistic viewers who want to experience fear and revulsion.", "overall": 2.0, "summary": "Too Dark for My Taste", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"},
{"reviewerID": "A3Q4NULWZU3RI", "asin": "B00IJNKQHM", "reviewerName": "Jason Sum", "helpful": [11, 16], "reviewText": "I remember back in the day 15 years or so before Hipster was even a wordThere's was this slick lil Cable channel Called A&E; with cool Nitch Programing & There Bio's on Celebsalong with re-runs of Homicide: Life on the StreetThe fact a Cable network understood how amazing Homicide: LOTS was and ran huge blocks of itAlways made me both amazed & happyFast forward to 2010 or so A&E; has become this lazy I mean lazy Network only focusing on So-Called Reality ShowsFor god sakes there Number one show is about a bunch of racist hillbillies that made there fortune by \"Hunting\"Seriously in 2014  American tv viewers are such \"Marks\" They will watch any Garbage put on tvwhile talented Writers and Actors get blindsided by The Reality tv MachineI will give A&E; major props for going into production with thisThose That Kill is without a doubt this really impressive basic Cable Series that you would see on a pay channel (How the rights were not sold to HBO or Showtime is beyond me)The fact A&E; bought the rights and went into production with a Show that has no business being on basic cable blows me awayGood for A&E; for trying to think out of the boxIt's so good on so many LevelsThink The Following much darker and edgy on so many levelsIt paints a picture of how being a Homicide detective isn't for any cop you have to be a little Damaged to catch killersThe Casting director did a great job!The Pilot has two breakout performancesChlo Sevigny was perfectly cast  as Catherine Jensen  (She is without a doubt the Female Johnny Depp) she will take some of the most off the wall rolls it's Not about a payday it's about perfecting her Acting CraftChlo is so awesome and under the radar when it comes to a Mainstream push!James D'Arcy as  Thomas Schaeffer  is the other breakout performanceThomas Schaeffer is much like Catherine Jensen  in the sense they both have allot of Layers I'll leave it at thatJames Morrison is one of those great characters actors (having him cast helps the Pilot he makes sense as a Homicide Lt. he's voice and overall presence adds high quality to the PilotThere's lots of small details that add alot of realism to itYou see people smoke (I'm not a smoker but, allot of Cops & Fireman smoke and something about seeing actors on tv smoke adds allot of authenticity! IMOThe story takes you down a deep rabbit hole (when you come back to the top you will very much feel dirty and effect)It will haunt you in the sense after you watch it... The pilot stays in your head and bounces around for a whileWhich Is a Good thing not enough forms of media does thisThe Quality is on par with any Big Budget Hollywood FilmJust Hopefully A&E; give this show and chance to grow and don't kill it off with a Cliff Hanger ending (Like they did with a Awesome A&E; Series Breakout Kings)Do yourself a favor watch the pilot If you don't get it or it just Creeps you out It's understandableBut, more tv shows need to be like thisIt's very much fearless and pulls no punchesOne of the strongest Pilots I've seen in a long time  The Pilot is Close to Perfect 9.8/10If the Pilot is any clue where this show can goThe sky is the limitKeep it up A&E; get behind Both Longmire & Those Who Kill  Enough of the hacky fake realityUPDATE 3-19-2014 Just found out that A&E; Pulled Those Who Kill from the Monday rotation after Bates Motel....Really they claim it's lack of RatingsIMO it's Not that my theory is simple (If you look around Reviewers are just being Huge Smocks Because \"Spoiler Alert\"  Chlo Sevigny's character is a Cutter and people are just Blasting the show just for that 'Cause Kids are gonna mimic A Show that's Not even in the teenage DemoI'm pretty sure A&E; is being Bullied by Special Interest Groups and A&E; is just taking it across the chinPeople Cut, People also smoke, and drink and beat there wife/kidsShame on you A&E; but, yet all the bad press They got with That Farce Duck Dynasty they fought for that piece of Garbage and you can't avoid all the promos for that Dead DuckEveryone should make noise regarding this show it's so Good and should not get Killed off/Canceled Because A&E; is afraid of the \"real\" subject matter", "overall": 5.0, "summary": "Brings the Art & Entertainment Back to A&E", "unixReviewTime": 1393632000, "reviewTime": "03 1, 2014"},
{"reviewerID": "A1BJL34PAVGDOB", "asin": "B00IJNKQHM", "reviewerName": "J. Doll", "helpful": [0, 1], "reviewText": "I loved the pilot of this show, but the second episode I didn't care for at all.  It's very violent and I haven't found a character that I can relate to.", "overall": 3.0, "summary": "Loved the pilot, next episode not so much", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"},
{"reviewerID": "A1KXZ7URF46CX2", "asin": "B00IJNKQHM", "reviewerName": "Joi Mcclary", "helpful": [5, 7], "reviewText": "I like the chemistry between Catherine and Thomas. I think the guy who played the serial killer in the pilot episode didn't do a great acting job. I'm interested in learning more about Catherine's past.", "overall": 4.0, "summary": "Seems promising", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"},
{"reviewerID": "A27VAGZX8L7UGL", "asin": "B00IJNKQHM", "reviewerName": "Leevora", "helpful": [0, 0], "reviewText": "I love this show!I swear, I spent most of the time screaming at my iPad while watching this show because the decisions and actions these detectives and victims made pissed me off!! lolThe lead female detective is flawed in so many ways and should have been kicked off the force several times & I would never want to be her partner.  The psychologist has more flaws than the detective and needs more help than the detective does.lolBut I could not get enough of this show!!  I do hope next season the writers let the other detectives shine a bit more because this season they all seemed so incompetent; I guess to make the female detective and psychologist seem smarter than everyone else.This show basically has 3 different stories going on at once.1.  The Professor / Psychologist / ?? Notes from a killer2.  The Detective / Step Dad / Missing Brotherand3.  The search & hopeful rescue of victims from psycho serial killer(s)-sigh-All the things that make a crime show worth watching!!!  And what a season ending we got! Whew!  I'm desperate for season 2 to start!", "overall": 5.0, "summary": "Wow! Wow! Wow!", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"},
{"reviewerID": "A1IIAXFBPK6WK2", "asin": "B00IJNKQHM", "reviewerName": "Lezli A. Polm", "helpful": [0, 0], "reviewText": "I really liked &#34;The Killing&#34; so this show was recommended to me. At first I had my doubts, but the characters drew me in and kept me watching. I'm now totally engaged. Looking forward to season 2.", "overall": 4.0, "summary": "Dark and riviting", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"},
{"reviewerID": "A2TOOTGECZLRHA", "asin": "B00IJNKQHM", "reviewerName": "M. Hays", "helpful": [18, 24], "reviewText": "If you enjoy crime dramas then this is definitely the ticket.  It reminds me a bit of The Killing which was an excellent show that did not get it's appropriate due on AMC.  The show was suspenseful throughout and it even had me jumping a few times.  The characters are a bit dark at this point but I'm sure that will change as the plot develops.  It left you with a nice hook at the end to bring you back for the next episode.  Overall, it was entertaining and interesting.  I will continue to watch this again and see how it progresses.", "overall": 5.0, "summary": "I'm hooked!", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"},
{"reviewerID": "A16XRPF40679KG", "asin": "B00IJNKQHM", "reviewerName": "Michael Dobey", "helpful": [1, 2], "reviewText": "After two interesting episodes this one was pulled from the air. They never gave it a chance really.  I would say that if you have paid for and completed episodes it makes no sense not to air the rest of them.  The show is a about a detective and a psychologist who solve crimes. The acting was very good as the lead actress is always top notch.  The setting was thankfully in someplace other than new York or California too. It was a grungy steel town , pittsburg?  Perhaps if they had put this on a night other than Monday it would have had a chance.  Still , why make a show and not even bother to show it's completed episodes?.  A@E doesn't have a lot of programming and they axed 'the glades' so they do have plenty of time that they could throw this one in again.  It was a interesting crime show , with a flawed lead character. You can watch the two aired episodes and you will find them engaging.", "overall": 4.0, "summary": "this was pulled.", "unixReviewTime": 1396051200, "reviewTime": "03 29, 2014"},
{"reviewerID": "A3SVDGKBTH0XKF", "asin": "B00IJNKQHM", "reviewerName": "Micky", "helpful": [0, 0], "reviewText": "Suspense grows with each episode and each episode is half &#34;story of the hour&#34; and &#34;on going drama&#34; with several twists (dark twists) but the 2 main characters are so well &#34;acted&#34; you are pulled in.  The perspective of the psychological behaviors explored in each episode are more than &#34;case book&#34; - enjoy this new show and hope the stories continue to be as good as they are now.", "overall": 5.0, "summary": "Those Who Kill & Those Who Die", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"},
{"reviewerID": "A3HM8SXVYJKSQV", "asin": "B00IJNKQHM", "reviewerName": "movieaddict", "helpful": [0, 0], "reviewText": "I was a bit skeptical at first with this show, but now I find myself waiting with baited breath for the next. I just truly hope this series get's picked up again for another season. This last episode has left me with SOOO many questions. I do love it though. Very suspenseful.", "overall": 5.0, "summary": "Brought me back to loving TV shows", "unixReviewTime": 1400716800, "reviewTime": "05 22, 2014"},
{"reviewerID": "A365MYNHF7HUFB", "asin": "B00IJNKQHM", "reviewerName": "Nancy L. Burris", "helpful": [0, 0], "reviewText": "While it held my attention and it was some what interesting. There is just that little kick that it lacks. Maybe it will improve?", "overall": 4.0, "summary": "Thinking about &#8230;&#8230;.THOSE WHO KILL", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"},
{"reviewerID": "A2GN8KZ2JVVFTU", "asin": "B00IJNKQHM", "reviewerName": "RockabillyReb", "helpful": [1, 7], "reviewText": "Oh my goodness, this show is bad. I thought maybe because chloe sevigny was in it, it might be good. It's all bad detective cliche with NOTHING redeeming , except maybe good fodder for satire. So, so very bad. Why, with shows like Hannibal and true detective, do people still make shows this bad? I don't get it.", "overall": 1.0, "summary": "So, so very stupid and terrible.", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"},
{"reviewerID": "A12OLJMUU7TYRF", "asin": "B00IJNKQHM", "reviewerName": "sybille ziegler", "helpful": [0, 1], "reviewText": "I have watched the original Danish &#34;Den som draeber&#34; and have to say it is way better than the softer American version. The US show is not bad but the original series is way more creepy/chilling.", "overall": 3.0, "summary": "Danish original is better", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"},
{"reviewerID": "A1K6E15IR9UBOE", "asin": "B00IK96YXU", "reviewerName": "Adele M. Klima", "helpful": [0, 0], "reviewText": "I found myself rooting for the Russian spies...to my shock. The show is very well written and, despite the violence, is now part of my regular list. Only wish somehow they would decide that the USA IS the best place and so would no longer be spies. Dream on.", "overall": 5.0, "summary": "Surprised", "unixReviewTime": 1394409600, "reviewTime": "03 10, 2014"},
{"reviewerID": "A1B98N7HQHWELI", "asin": "B00IK96YXU", "reviewerName": "Angelic", "helpful": [0, 0], "reviewText": "Very good acting,great plot, you dont forget it.  Kerry is really good in this her acting is awesome and the guy who plays her husband totally rocks", "overall": 4.0, "summary": "Very good show", "unixReviewTime": 1396656000, "reviewTime": "04 5, 2014"},
{"reviewerID": "AXA1089PLTAS3", "asin": "B00IK96YXU", "reviewerName": "Ashley Thomas", "helpful": [0, 0], "reviewText": "My husband and I love this show! I love how this show is unexpected. You never know what obstacle or celebration will come next. I highly recommend the show!", "overall": 5.0, "summary": "Love it!", "unixReviewTime": 1400457600, "reviewTime": "05 19, 2014"},
{"reviewerID": "A2BJEGIQ7YFSGT", "asin": "B00IK96YXU", "reviewerName": "Belinda Roman", "helpful": [0, 0], "reviewText": "This season has been just as intriguing as the first season as we watch the Cold War unfold during Reagan's presidency.  Good TV so far.", "overall": 5.0, "summary": "Good Old Spy versus Spy", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"},
{"reviewerID": "A1LI5M7UMUHGRC", "asin": "B00IK96YXU", "reviewerName": "Beth Trissel \"Beth Trissel, Historical & Ligh...", "helpful": [0, 0], "reviewText": "I am finding Season Two just as engrossing as Season One. Very well done series. The twists and turns keep me guessing.", "overall": 5.0, "summary": "Fascinating show", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "A373HKXPLK5B3P", "asin": "B00IK96YXU", "reviewerName": "Bill", "helpful": [0, 0], "reviewText": "I like the period piece taking place in the '80s. The characters are believable and well developed. A good dramatic show.", "overall": 5.0, "summary": "Well done!", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "A3B0XAXU0YVT33", "asin": "B00IK96YXU", "reviewerName": "Bonnieboop \"Major Reader\"", "helpful": [0, 0], "reviewText": "The Americans, Season 2 started off with a bang and hasn't let up -- so far.  For fans of Breaking Bad, House of Cards, and all the other great shows out there, I highly, highly recommend this series.", "overall": 5.0, "summary": "Fabulous Season -- So Far!", "unixReviewTime": 1394582400, "reviewTime": "03 12, 2014"},
{"reviewerID": "A14AZICA6QKR22", "asin": "B00IK96YXU", "reviewerName": "carolG", "helpful": [0, 0], "reviewText": "At first I thought &#34; who cares about spies during the cold war&#34; But I found the series to be very interesting and suspenseful.Just started season2", "overall": 5.0, "summary": "Sassy, intriguing, and very good acting", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"},
{"reviewerID": "AW3VZ5O895LRK", "asin": "B00IK96YXU", "reviewerName": "carol irvin \"carol irvin\"", "helpful": [0, 0], "reviewText": "The first question is always does the second season hold up to the first.  For me, the answer is a strong YES. Matthew Rhys especially, as Phillip, the Russian spy, travel agent and family man remains every bit as wonderful as ever. Even if I hated the rest of the show, I would watch it just for him.  This season takes everything up a notch as everything gets harder. For one, the kids are getting much harder to control. The daughter is sneaking around and checking them out.  The son is quietly defying them. Any of these acts could get them caught big time.  Even worse, another Russian spy family is massacred in a hotel room, a family just like them. Nothing has ever thrown our female spy into such a crisis as this has. Phillip's fake marriage to Martha takes on new dimensions.  It really is a great show. I highly recommend it.", "overall": 5.0, "summary": "It's as Good as Season One", "unixReviewTime": 1397174400, "reviewTime": "04 11, 2014"},
{"reviewerID": "ALH0DYDC29Q2I", "asin": "B00IK96YXU", "reviewerName": "chiefarchitect \"chiefarchitect\"", "helpful": [0, 0], "reviewText": "Good concept with Russion KGB infiltrating US to obtain information while masquerading as an American family.  Great plots,lots of action and worth the series to get you hooked !", "overall": 5.0, "summary": "Cold War Heating Up", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"},
{"reviewerID": "A7V7T1G561PVY", "asin": "B00IK96YXU", "reviewerName": "C. Hill", "helpful": [1, 1], "reviewText": "For some reason it appears to have more gratuitous sex scenes which do not appear to be germane to telling the story.  I still enjoy the shows overall though.", "overall": 3.0, "summary": "Still A Good Show But--------------------", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A11WJXVIIPADZR", "asin": "B00IK96YXU", "reviewerName": "Cyberwiz \"Cyberwiz\"", "helpful": [0, 0], "reviewText": "Interesting story lines involving complex perspectives. The conflicted emotions the characters exhibit give way to embracing love of the mother country and finding out there are positive things found in the &#34;enemy's&#34; society as well.", "overall": 4.0, "summary": "I keep coming back for more", "unixReviewTime": 1398988800, "reviewTime": "05 2, 2014"},
{"reviewerID": "A1THASGM7EP9UF", "asin": "B00IK96YXU", "reviewerName": "Dangerman \"Dan G.\"", "helpful": [1, 1], "reviewText": "Set in the 80s when there was still a KGB, this show chronicles Russian agents posing as suburban Americans in the D.C. area.  But the best aspects of this drama are the performances by Matthew Rhys and Keri Russell as the undercover Russians.  More than just believable.  Combine that with compelling stories which are about more than just completing missions, and you've got a recipe for a great series.  Put your expectations aside, you will be bowled over by where these stories go and how the characters become increasingly watchable.", "overall": 5.0, "summary": "the good ol' cold war days", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"},
{"reviewerID": "A2VPSFK81ORZBS", "asin": "B00IK96YXU", "reviewerName": "dcbookworm \"dcbookworm\"", "helpful": [0, 0], "reviewText": "awesome, period details, politics, fascinating", "overall": 5.0, "summary": "do watch this", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"},
{"reviewerID": "A9ZRYCLU6309E", "asin": "B00IK96YXU", "reviewerName": "Dean W. Wood", "helpful": [0, 0], "reviewText": "FX creates another great season of the Americans. Being that I grew up during this period of time as a twenty something year old man. I remember the Cold War and the tensions with Russia. So glad it is not as intense now.", "overall": 5.0, "summary": "Another Exciting Season", "unixReviewTime": 1397347200, "reviewTime": "04 13, 2014"},
{"reviewerID": "A1OSVPI2VGWJZ2", "asin": "B00IK96YXU", "reviewerName": "Deborah J. Towns", "helpful": [0, 0], "reviewText": "A very interesting show that depicts the cold war very well. I love the characters. The acting is real and very believable.", "overall": 5.0, "summary": "Interesting", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"},
{"reviewerID": "ALL0NWP70Y0O", "asin": "B00IK96YXU", "reviewerName": "Denise F. Eliot", "helpful": [0, 0], "reviewText": "Despite excellent production values, this show is boring. I wish the writers would channel Vince Gilligan (Breaking Bad) to liven things up.  For now, though, it's repetitive and dull, and lacks an interesting perspective.  The characters haven't developed in any complex ways, and the one who gave pleasure, Claudia (Margo Martindale), has been retired.  Maybe she wanted out of her contract!  I had high hopes for The Americans.  Why the raves?  Well, what can you expect when people quote &#34;Girls&#34; as if it were written by Oscar Wilde?  Maybe Fargo will be fun!", "overall": 3.0, "summary": "Dreary", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "A1X3GHUIYI9XMJ", "asin": "B00IK96YXU", "reviewerName": "Denn", "helpful": [0, 0], "reviewText": "Well done", "overall": 4.0, "summary": "Well done", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"},
{"reviewerID": "A2UFEG2FMO8RGS", "asin": "B00IK96YXU", "reviewerName": "Dr. Philgood \"Dr. Philgood\"", "helpful": [0, 0], "reviewText": "Don't get me wrong, I love watching Jack Bauer do his thing, but The Americans is extremely intriguing and can't wait to see Season 3 become available online - I'm a Trucker so I don't have the luxury of watching the shows when they air, but love watching them when they do become available on the road.  Great show - highly recommend to all", "overall": 5.0, "summary": "BETTER THAN 24!!!", "unixReviewTime": 1402012800, "reviewTime": "06 6, 2014"},
{"reviewerID": "AJ3SKRLYBB88S", "asin": "B00IK96YXU", "reviewerName": "EJ \"EJ\"", "helpful": [0, 0], "reviewText": "I love the Americans. What I am getting fed up with Amazons deceptive emails, &#34;how many stars.....&#34; then I click and suddenly have to be a TV critic.", "overall": 5.0, "summary": "They asked for a rating, I gave it.", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "A3P54PXQIM4JMS", "asin": "B00IK96YXU", "reviewerName": "ElceeR", "helpful": [0, 0], "reviewText": "This show is so well written, acted and directed that I sit on the edge of my seat for each episode. I just can't wait for season 3 ! What will they decide to do about their children?", "overall": 5.0, "summary": "Great Show", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"},
{"reviewerID": "A22HSFI45TMPLA", "asin": "B00IK96YXU", "reviewerName": "forex review", "helpful": [0, 1], "reviewText": "After the middle of season 2 I find myself asking when is the writer going to take more chances.  So many things could happen and we could shock us once in a while after the investment we have made in your show.I would watch it for sure if you are wanting a good show to show cliffhanger, but don't think it will surprise because it seldom will.", "overall": 3.0, "summary": "Not Bad Not Great Too Slow", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"},
{"reviewerID": "A2KILUPS6S5YL", "asin": "B00IK96YXU", "reviewerName": "Franklin", "helpful": [2, 2], "reviewText": "This is a great genre piece placed in the time period of the Cold War.  Great acting, suspenseful, well developed plot.  The characters really bring you into the story.  You are either going to love it or hate it though.  It deals with the era of spying, and weaves a great drama around the characters that composed this era.  It has not disappointed, and has been extremely enjoyable.  Hope you enjoy.", "overall": 5.0, "summary": "Great Series", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"},
{"reviewerID": "A1O62SXLPD0UBD", "asin": "B00IK96YXU", "reviewerName": "Garrett", "helpful": [0, 0], "reviewText": "I've seen a number of spy movies, the most notable being The Maltese Falcon. (Not *really* a &#34;spy&#34; movie, but.. there are spies, and they attempt intrigue.)Anyhow, spy movies compress way too much into 90 minutes or less. The Americans develops the characters beautifully, enabling the viewer to observe the impact of their job and life decisions on their daily lives. I love it, and I'd watch it forever.I also love that we aren't the good guys, for a change. The writers have a refreshingly neutral view which depicts all superpowers as bad guys, and that hits very close to home for me. This is fantastic television, and I recommend it to anyone I meet.", "overall": 5.0, "summary": "Best Spy Novel I've Never Read", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "AG464LWQCN7VE", "asin": "B00IK96YXU", "reviewerName": "Gary Tashman", "helpful": [0, 0], "reviewText": "Season two has avoided the sophomore  jinx of other series. It operates on so many different levels. In the guise of a spy thriller it  is really a story about love, marriage, and family. You care about everyone . You know it is not going to end well for these people . In the end this series will probably break our heart, but you can't look away.  I look forward to every episode .", "overall": 5.0, "summary": "Still the best show on TV.  One of the most complex  series out there.", "unixReviewTime": 1394668800, "reviewTime": "03 13, 2014"},
{"reviewerID": "A2A4TYSU656F9H", "asin": "B00IK96YXU", "reviewerName": "gitaday \"Gitaday\"", "helpful": [0, 0], "reviewText": "I love Matthew Rhys.  He is a great actor and phenomenal in this show.  Think Bourne Identity plus Mad Men.  New and innovative, this show is set in the seventies and tells the story of the Cold War and the Russian spies who lived undercover in the US for years.  Graham Yost is producing which should be enough to get you to watch the first season.  You will soon be hooked.", "overall": 5.0, "summary": "One of the best on TV.", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "A1E9BSAYH12P1K", "asin": "B00IK96YXU", "reviewerName": "grands", "helpful": [0, 0], "reviewText": "Enjoying this season but was off to a slow start.  Was definitely not as intense or exciting as season 1. It did pick up as the season went on.  Such an interesting concept & probably did happen!  Enjoy!!", "overall": 3.0, "summary": "Little disappointing start to season, but it picked up.", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"},
{"reviewerID": "A30Y9HOU6UU88P", "asin": "B00IK96YXU", "reviewerName": "Harrison R.T.Davis", "helpful": [0, 0], "reviewText": "a fabulous show that at first looks underwhelming, and then it grabs you buy the pants/skirts---and gives you fabulous entertainmentwhich you can find no where else. THE F.B.I. always does fabulous work!! NO LET DOWN HERE!!", "overall": 5.0, "summary": "No way you will ever beat THIS SHOW FOR SOLID ENTERTAINMENT & USA VALUES:", "unixReviewTime": 1403740800, "reviewTime": "06 26, 2014"},
{"reviewerID": "A3KC1GSOVI0C38", "asin": "B00IK96YXU", "reviewerName": "IzzyReal", "helpful": [14, 16], "reviewText": "Since I don't watch television, per se, I would see the spots about this show when I was at a friend's house watching football. &#34;Hmmph! Keri Russell? Yeah, a real bada*s there. More network schlock.&#34; Then I was checking for new shows in my Amazon Prime line-up and saw that this show was available...for free. Or close to it. I removed my monacle and decided that I might lower my usual lofty standards and give this show a chance. Give me another slice of humble pie, please. Keri Russell is indeed a mean little creature. A new look at a genre that has been overdone many times over and well done also. Yes, I'm sure if you look at these episodes with a magnifying glass, you would and could find some plot holes and &#34;wha..?&#34; moments. But who cares? Good twists and turns and bombshells going off every time you turn around. I just started Season 2 and I am trying to hold back, but... I am weak...", "overall": 5.0, "summary": "Let the bingeing begin!", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"},
{"reviewerID": "A9ZFNLMFF1U8M", "asin": "B00IK96YXU", "reviewerName": "Janet C. Walker", "helpful": [0, 0], "reviewText": "These were the commies under the bed for years,  Very well acted and put a human face on these characters.  Of course we want them to be caught, but no need to hurry about it.  It could use more Margo.", "overall": 5.0, "summary": "Very well performed!", "unixReviewTime": 1399939200, "reviewTime": "05 13, 2014"},
{"reviewerID": "A249CSLGYCAP76", "asin": "B00IK96YXU", "reviewerName": "Janice R. Due", "helpful": [0, 0], "reviewText": "top notch excitement,spy thrill at its best,every episode a new adventure,excellent stars,look forward to every week.hoping for season 3", "overall": 5.0, "summary": "thrilling", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "ARADEBLBT3P17", "asin": "B00IK96YXU", "reviewerName": "Jason Nobody", "helpful": [2, 8], "reviewText": "The first season was great... this one is dominated by tired, boring dialog in Russian with subtitles. The main, interesting characters are ignored as the writers go on and on about stupid, boring plots... while the original ideas for this great show get lost.Yuck. Cancel my season pass.... I'm done.", "overall": 1.0, "summary": "Don't get this... it's not the first season", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"},
{"reviewerID": "A2N4VFIQFIPE0P", "asin": "B00IK96YXU", "reviewerName": "J. Carpentier", "helpful": [1, 1], "reviewText": "It's good but (so far) lacks what made the 1st season so great. I'll keep watching because it is still quality...but this seems to be a sophomore slump.", "overall": 3.0, "summary": "Loved Season 1. Season 2 isn't wowing me yet.", "unixReviewTime": 1398211200, "reviewTime": "04 23, 2014"},
{"reviewerID": "A1EPOBNL0BGG3T", "asin": "B00IK96YXU", "reviewerName": "joe shlobotnik \"Mountaineer Fan\"", "helpful": [0, 0], "reviewText": "This show picks right up where Season One left off and just gets better from there.  The plot twists are amazing.  I bought it on Prime (in HD, of course)  just so I could watch it again w/o the commercials.  Worth every penny.", "overall": 5.0, "summary": "What a show!", "unixReviewTime": 1403395200, "reviewTime": "06 22, 2014"},
{"reviewerID": "A5JM6GF13W9SN", "asin": "B00IK96YXU", "reviewerName": "john charles &#34; chuck&#34; \"john c scharri...", "helpful": [0, 0], "reviewText": "I have throughly enjoyed the series The Americans. I hope they will continue to write similar episode's in the near future.", "overall": 5.0, "summary": "The. Americans", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A39K9IX6EIPELL", "asin": "B00IK96YXU", "reviewerName": "John D. Sens", "helpful": [0, 0], "reviewText": "I really like spy vs. spy fantasy.  That's what &#34;The Americans Season 2&#34; is.  It has just enough &#34;reality&#34; to it to keep things interesting.  Issues that are obvious if you wanted to pay serious attention are easily overlooked, e.g. the children appear when needed, otherwise the parents are free to do whatever &#34;the center&#34; directs.  Kind of like Mission Impossible on speed.", "overall": 5.0, "summary": "Love it.", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"},
{"reviewerID": "A1X5U5VN7SV73K", "asin": "B00IK96YXU", "reviewerName": "J. P. Hale \"jphale\"", "helpful": [0, 0], "reviewText": "The KGB is trying to keep USSR in the game ... they have placed agent couples in America who have become very Americanized and, thus, nearly undetectable. And, they are very effective spies. The plots are fast-moving and varied.The actors are special and believable ... they make the plots happen crisply.I highly recommend starting with Season 1 and, then, continuing with Season 2.", "overall": 5.0, "summary": "Great Plot and Great Actors", "unixReviewTime": 1400198400, "reviewTime": "05 16, 2014"},
{"reviewerID": "A1ISQ4BFCCGKVY", "asin": "B00IK96YXU", "reviewerName": "Keats", "helpful": [0, 0], "reviewText": "excellent show, very entertaining. Watch this and stick with it!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"},
{"reviewerID": "AQ56LY2AW7GWK", "asin": "B00IK96YXU", "reviewerName": "K. genereux \"k.genereux\"", "helpful": [29, 31], "reviewText": "I really like where this second season may be heading. As our Cold War-waging americans and russians vindictively throw logs on the fire, Elizabeth is evolving into a more emotionally nuanced character. In the Season 1 finale Philip risked his own life to save Elizabeth's. And I believe this act of loyalty won Elizabeth over, letting loose intense emotions that she may need to grapple with this season. Have to wait and see.The slow burn of intimate and difficult relationships may be what sets The Americans apart from other TV dramas out there right now.  A lot of them avoid exploring intimacy and instead go into overdrive with personality twists or convoluted plotlines that can become ridiculous. But so far, with the backdrop of the cat and mouse game of \"Cold War\", The Americans has chosen a more provocative path to suspense.  (But don't worry action lovers. I bet there are plenty of car chases in the Jennings' future: Philip's alter-ego as James Bond can't be suppressed for too long!)Lots of TV shows about spies in turtleneck sweaters have been done before. But definitely not like this. Being on cable, it gets to push the sex and violence envelope. \"The Americans\" doesn't flinch in portraying a very \"hot and heavy\" Cold War, brimming with bullet-to-the-head assassinations, naked backsides and graphic honeytrap sex.  It's strange. I might have thought these scenes  shocking and gratuitous a few years ago, but now it just registers as eyebrow raising and elemental.Last night's episode definitely took the chill off the room!One more thing:  If \"adult\" sexual situations with near nudity are a deal-breaker problem for you (hi mom!), my advice is to stick with network TV shows.", "overall": 5.0, "summary": "The Slow Burn of a Not-So-Cold War", "unixReviewTime": 1393632000, "reviewTime": "03 1, 2014"},
{"reviewerID": "AHWMZQKU3FTI1", "asin": "B00IK96YXU", "reviewerName": "Kisa", "helpful": [0, 0], "reviewText": "Love this show. The writing is excellent. I just wish the episode had more meat in them. Each episode is like watching 20 mins for 2.00 per episode. ...", "overall": 5.0, "summary": "AWESOME and Hooked", "unixReviewTime": 1396656000, "reviewTime": "04 5, 2014"},
{"reviewerID": "A2KZKFAJ1NLVJM", "asin": "B00IK96YXU", "reviewerName": "K. Thomas", "helpful": [0, 0], "reviewText": "Funny they are switching roles. Great show.. 2nd Season better than the first. Which is unusual. Keep up the good work.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"},
{"reviewerID": "AQGQKGNSZ21T9", "asin": "B00IK96YXU", "reviewerName": "Lawman", "helpful": [0, 0], "reviewText": "I grew up in the 80's so this show brings back a lot of memories.  Great story with great actors.  I love seeing all the cars, big hair, and old tech in this show.", "overall": 5.0, "summary": "Awesom show.", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"},
{"reviewerID": "A25JF4201HQEJF", "asin": "B00IK96YXU", "reviewerName": "Mostlee \"Everquest fan\"", "helpful": [0, 0], "reviewText": "I love this show, even when the story isn't the greatest or it gets slowwww.  It's almost in that category of shows you don't admit watching (at work).  Right up there with Nip/tuck, dexter, etc.  Wish they would add more episodes per season; this isn't England!", "overall": 5.0, "summary": "More episodes please :D", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"},
{"reviewerID": "A3H05Y9Z8IAGP7", "asin": "B00IK96YXU", "reviewerName": "MWOO", "helpful": [0, 0], "reviewText": "It captures the Cold War Era perfectly.  The casting of characters could not be better.It leaves a lot of thought in your mind long after viewing the episode.", "overall": 5.0, "summary": "Cold War Era", "unixReviewTime": 1398211200, "reviewTime": "04 23, 2014"},
{"reviewerID": "A3GV75YMLZA87O", "asin": "B00IK96YXU", "reviewerName": "Nora", "helpful": [17, 22], "reviewText": "The show picked up right where it left off. Their daughter may be their undoing in the end. And the interest in the Russian embassy woman who turned herself in to the KGB really continues the intrigue.", "overall": 5.0, "summary": "Good start to the season", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"},
{"reviewerID": "A16URLIWWPFLHT", "asin": "B00IK96YXU", "reviewerName": "Odell Hobbs", "helpful": [0, 0], "reviewText": "When one considers what the Fore-Fathers intended for these United States I am sure that the concept of Freedom and human rights were as efflorescent as those times could garner. But time yields to no-one and to betray the wonderful facets of life for the convoluted ideals of men whose main objective is to one up another mans thoughts and renderings for his own ......well that lands squarely in the realm of selfishness .........whole societies and cultures have been displaced for the myopic and self-centered whims of men whose objectives have been to have their pockets filled with ...rubies red with the blood of those who trusted the leadership and words of those men to be the rudders of their lives. The corrosive under belly of intrigue, deception, and PATRIOTISM seems to reaching its critical mass as a culture of flailing allegiance and culture of pyrrhic freedoms layout their conceptual essences in this serial. Agents......... Double Agents.... THE SPIRITS ARE ABOUT TO .......SPEAK !!!!!", "overall": 5.0, "summary": "Things are heating up in this Cold War", "unixReviewTime": 1398902400, "reviewTime": "05 1, 2014"},
{"reviewerID": "A2I2KMAA9CZB5F", "asin": "B00IK96YXU", "reviewerName": "ORURO H.S.", "helpful": [1, 1], "reviewText": "This series is entertaining and totally ludicrous but entertaining. You can't really make a standard family story out of two spies who are heartless killers. And Phil's phony marriage is actually ludicrous The best part of the show is the neighbor Stan Beeman who is an FBI double agent who fall in love with his Soviet asset.", "overall": 4.0, "summary": "NOT VERY CREDIBLE- THE UNAMERICANS", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"},
{"reviewerID": "A2MLZKVFLROON8", "asin": "B00IK96YXU", "reviewerName": "Paul B. \"mribp1\"", "helpful": [0, 0], "reviewText": "I grew up during the ColdWar. We studied about this type of Soviet activity in the US. Makes one wonder if he had ever met any Soviet mole. I find the acting engaging. The characters are very believable and interesting. The two main characters seem to have a soul.", "overall": 5.0, "summary": "Tis series is awesome", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"},
{"reviewerID": "A3DP8XDR3D9ZNY", "asin": "B00IK96YXU", "reviewerName": "Peter F. Foley \"bunker builder\"", "helpful": [3, 4], "reviewText": "love the show, but its like a vampire story, Just drawing a map with all the dead would point to the locus of the spies.... Occasion Meme slips as 21st century ideas leak through into the set, dialog, and plot.....Maybe someone could start a back story blog to explain some of plot points like the Super Quiet submarine prop cutting tech(wasn't it actually stolen from the Japenese?)  this  tech is used today to save fuel on high speed container ships around the world....And the use of foreign posts to bring in black market items back to mother Russia,  maybe some developement of the various second class nationalities being discriminated against by ethic Russians...", "overall": 4.0, "summary": "Too many dead bodies...", "unixReviewTime": 1394236800, "reviewTime": "03 8, 2014"},
{"reviewerID": "A3JNVOV0L3UI0J", "asin": "B00IK96YXU", "reviewerName": "Peter Mancini", "helpful": [0, 0], "reviewText": "This show is addictively good. Watch seasons 1 and 2. You won't regret the choice. I can't wait for Season Three.", "overall": 5.0, "summary": "Smart, well done, believeable", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"},
{"reviewerID": "A1PQB5FCNZA6W2", "asin": "B00IK96YXU", "reviewerName": "Phyllis", "helpful": [0, 0], "reviewText": "Really well done this show - I didn't think all that I was going to like it - I thought I was going to be probably just silly but in fact turns out it's really really good. We can't wait for each week's new episode!", "overall": 5.0, "summary": "WATCH THIS SHOW!", "unixReviewTime": 1395705600, "reviewTime": "03 25, 2014"},
{"reviewerID": "A1IIOE3321ES8U", "asin": "B00IK96YXU", "reviewerName": "Rib15", "helpful": [0, 0], "reviewText": "Watch out AMC! with the end of Breaking Bad and the upcoming end of Mad Men, you have a new challenger for best original Cable dramas. Tight writing, excellent performances, great period detail. Good stuff.", "overall": 4.0, "summary": "It just keeps getting better and better", "unixReviewTime": 1399507200, "reviewTime": "05 8, 2014"},
{"reviewerID": "A2T05OQ5STEGDZ", "asin": "B00IK96YXU", "reviewerName": "Robert Miller", "helpful": [0, 0], "reviewText": "Too much sex to little espionage, but, a great season with new handlers and drama. Plot seems too bogged down in logistics and short on action. The FBI agent needs to go away as does his love interest counterspy.", "overall": 5.0, "summary": "The Americans season too..much sex.", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"},
{"reviewerID": "A1E4HDIBRPUA62", "asin": "B00IK96YXU", "reviewerName": "Robin Hood \"California bookaholic\"", "helpful": [3, 5], "reviewText": "After a breathtaking, fast-paced Season 1, Season 2 has been a little slow getting going and I have not been as excited as I was with Season 1. I hope it picks up. I think perhaps it is the overemphasis on Paige. She is turning into a rather petulant, difficult teen, and I don't find her parts of the stories as compelling. It reminds me of last season on Homeland. We had another teenage daughter there, who was equally petulant and difficult to deal with, and in my opinion both series have been spending too much time on their fussy teenage daughters. I know the parents are worried about the safety of their children, but I would rather see that playing out in perilous situations rather than focusing on Paige's running off on her own, trying to verify the &#34;aunt's&#34; existence.", "overall": 3.0, "summary": "A little disappointed with Season 2 so far...", "unixReviewTime": 1395100800, "reviewTime": "03 18, 2014"},
{"reviewerID": "A2XRMQA6PJ5ZJ8", "asin": "B00IK96YXU", "reviewerName": "Roger J. Buffington", "helpful": [0, 0], "reviewText": "This is one of the best TV series ever and is worthy of every one of its five stars. Season Two continues the intricate plot in which Phillip and Elizabeth Jennings, apparently a model family in the suburbs, are actually KGB deep cover agents engaged in spying against the US Government.The time is circa 1980, shortly after President Reagan is elected President so in this sense the series is a period piece.  The KGB is deeply paranoid about President Reagan, the Star Wars program, the Central American contra initiative, and pretty much everything that Reagan did to finally defeat the Soviets.  But that has not happened yet and in fact, in this series, the KGB often wins.This is an excellent series that is head-and-shoulders above the usual Hollywood stuff.  It is highly addictive and entertaining and I never miss an episode.  RJB.", "overall": 5.0, "summary": "The Series Continues ...", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"},
{"reviewerID": "A1939G7K0LLQ8P", "asin": "B00IK96YXU", "reviewerName": "Rugby", "helpful": [0, 0], "reviewText": "This show is different exciting and complex. It has not received the attention it deserves yet. As good and somewhat oike Burn Notice with some twists.", "overall": 4.0, "summary": "very interesting show", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A2EBDMMQ9EBEIU", "asin": "B00IK96YXU", "reviewerName": "Sadie", "helpful": [0, 0], "reviewText": "Makes me think twice about all those years that I lived and was oblivious...(teenagers!). The things the two countries did to get ahead in the cold war and the lack of technology at the time almost make me nostalgic. We knew who our enemy was and espionage required planning, forethought and brains. Today it is just who has the most digital recording devices and the biggest satellite. Enjoying the show!", "overall": 5.0, "summary": "Awesome show.", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"},
{"reviewerID": "A2FQQ4XE5T8CZ9", "asin": "B00IK96YXU", "reviewerName": "S. Fox \"oyee\"", "helpful": [0, 0], "reviewText": "Great writing but ultimately got too depressing , even for me.", "overall": 4.0, "summary": "Four Stars", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"},
{"reviewerID": "A32NR7LJCXYTZV", "asin": "B00IK96YXU", "reviewerName": "Skeptical Shopper", "helpful": [0, 0], "reviewText": "The acting. The plot. The plot twists. There isn't anything I don't love about this show. The season finale was very satisfying end to the season, and second gen agents - is a such a believable idea, I can't wait to see what they do next season.", "overall": 5.0, "summary": "Wow. It doesn't get any better than this!!", "unixReviewTime": 1400716800, "reviewTime": "05 22, 2014"},
{"reviewerID": "A32A78GI6956FW", "asin": "B00IK96YXU", "reviewerName": "Stanley Cook", "helpful": [0, 0], "reviewText": "Great action story of a KGB family living in DC in the 80s.  Lots of blood and a little scary for some but a great story.  Looking forward to the next season.", "overall": 5.0, "summary": "Great action story of a KGB family living in DC ...", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"},
{"reviewerID": "ASXL2YF7KKC1U", "asin": "B00IK96YXU", "reviewerName": "Steve1290", "helpful": [0, 0], "reviewText": "No vampires, no animation (some of it is ok), no 30 somethings cohabiting an apartment facing up to the major themes in life.  This series is real &#34;stuff.&#34;  I know, I know.  Some of it is pretty far out there, but it's TV.  I think it is plausible that a good deal of these shenanigans occurred during the cold war.  I'm curious as to how much of the thematic material and the actual incidents and the &#34;Rezidentura&#34; were documented.operation.  Anyway I thought the writing and the acting were superb, but would reserve my highest praise for the amazing disguises and for the actors who assumed entirely different demeanors when in them.", "overall": 5.0, "summary": "FINALLY SOMETHING AIMED AT MY \"DEMOGRAPHIC.\"", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"},
{"reviewerID": "A2N9MQPDFPGBBY", "asin": "B00IK96YXU", "reviewerName": "Steve Jameson", "helpful": [0, 0], "reviewText": "Great show, season 2 has been as good as season 1 so far and we are only a few episodes in.", "overall": 5.0, "summary": "Season 2 as good as 1", "unixReviewTime": 1397952000, "reviewTime": "04 20, 2014"},
{"reviewerID": "A37PFXSWGPOQ1C", "asin": "B00IK96YXU", "reviewerName": "Subq", "helpful": [0, 0], "reviewText": "I chose this rating because of too much nudity and sexual scenes. I feel they could get their point across without all of that. Certainly not for children or teens. However the series has great acting&#60; a lot of suspense and intrigue. It keeps you guessing. We just fast fprward through the objective(to us) scenes! We lived through those times!!! amazing!", "overall": 4.0, "summary": "great acting", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"},
{"reviewerID": "AFR2Q43XVOIVA", "asin": "B00IK96YXU", "reviewerName": "Tenderfoot", "helpful": [0, 0], "reviewText": "Russian agents posing as a typical American family who speak better English than we do; have children and live the American dream with a well honed spin. After watching the first episode on my kindle I was hooked. The graphic image as intro is a great come-on. Most tv series are to me similar to each other. This one based on truth is unique. Wow. The Cold War. Bad guys. Good Guys??? Are there any? Constant suspicians. An FBI agent lives across the street. Coincidence??? Unswerving dedication to the motherland. Why you ask? Watch! Acting is superb especially when characters are in disguise. My only criticism is that the russian to english subtitles could stay on screen a bit longer. Please note that this show is NOT for children requiring a mature audience, Seriously.", "overall": 5.0, "summary": "Absolutely Intriguing!!!", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"},
{"reviewerID": "A1PPJEE2QRCCHV", "asin": "B00IK96YXU", "reviewerName": "Terri", "helpful": [0, 0], "reviewText": "Written from the view point of Amercanized Russian spies, the unique premise of this show drew me in. The viewer ends up sympathetic to, and actually rooting for this seemingly harmless couple as the do their part to further the interest of their mother land.", "overall": 4.0, "summary": "I'm A Fan", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"},
{"reviewerID": "AIQE6OGP2OYNU", "asin": "B00IK96YXU", "reviewerName": "vich", "helpful": [0, 0], "reviewText": "These writers deserve kudos for keeping it exciting and moving forward.  Most series that start off great get stuck in a rut with hit-n-miss episodes.  So far; they've kept it in the &#34;great&#34; category.With the uptick in Russian-American tensions; this topic takes on a new air of reality.I'm sad that there are only 2 episodes left to the season.  I guess that's better than Mad Men or Under The Dome that split their latest seasons into 2 years.", "overall": 5.0, "summary": "Keeping it fresh", "unixReviewTime": 1399852800, "reviewTime": "05 12, 2014"},
{"reviewerID": "A5E5QRM74JPOD", "asin": "B00IK96YXU", "reviewerName": "William R. Toddmancillas", "helpful": [0, 0], "reviewText": "Unique, exciting, provocative series.", "overall": 5.0, "summary": "A unique series.", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"},
{"reviewerID": "A3JVRMD5C1TW3J", "asin": "B00IK96YXU", "reviewerName": "WLee", "helpful": [1, 1], "reviewText": "Wow the cliffhanger at end of season one really made me an unhappy camper having to wait to see what was to come, season 2 is every bit as good and the show keeps my husband and I on our toes every week, no filler episodes that have no meaning really that they just add in to string you along to the next cliffhanger, through and through it is a nailbiter, a thought provoking show, and yes it is a drama but those get ups they wear, I know one of the producers and costume designers must be friends and have a sense of humor. Love it, Clark is Hot", "overall": 5.0, "summary": "I was not so sure at first but now I am", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"},
{"reviewerID": "A28Q2LJTX52PMI", "asin": "B00IKFSSTW", "reviewerName": "1farstar", "helpful": [4, 9], "reviewText": "I'm sure this is a terrific film but I'll see you all in Hell before I pay that much to see it at home!For $14.99 I'll go see a movie in a theatre on a huge screen and have really good popcorn.  No way will I ever pay theatre prices to watch a movie at home.", "overall": 5.0, "summary": "$14.99, seriously ???", "unixReviewTime": 1399939200, "reviewTime": "05 13, 2014"},
{"reviewerID": "A10H52874HQ6HH", "asin": "B00IKFSSTW", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "We found this presentation of events very interesting if not a bit daunting!", "overall": 4.0, "summary": "Four Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"},
{"reviewerID": "A2SLA0SXRQV8M0", "asin": "B00IKFSSTW", "reviewerName": "Andres C. Salama", "helpful": [1, 1], "reviewText": "If you want to see a historically accurate film about the eruption of the Vesuvius in 79 AD that destroyed Pompeii, then this is not the movie for you. If instead you want to see an entertaining sword and sandals picture, well, then you might enjoy this movie. Milo (Kit Harrington) is a Celtic warrior imprisoned by the Romans during the Invasion of Britain and turned into a slave. Having seen all his family killed by the invading Romans, he is thirsty for revenge. Slated to fight as a gladiator in Pompeii just before the explosion of the volcano, the unexpected events might make his dreams come true.This movie looks like an extended, lesser chapter of the TV series Spartacus. Kiefer Sutherland is a very good villain as a nasty power hungry Roman senator. Unfortunately, not the same can be said of the uncharismatic actor portraying Milo, the Orlando Bloom look alike Kit Harrington. His love interest, the Roman Cassia, played by Emily Browning, does not impress much. But Adewale Agbaje does a fine impression as Atticus, the African gladiator that becomes Milo's ally (this character clearly mirrors Doctore in Spartacus, that was played by Peter Mensah).The fight scenes are fine, and so is the volcano explosion (though the use of computer imagery is a bit obvious at times). The photography is sometimes too dark and murky.", "overall": 3.0, "summary": "Moderately entertaining", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"},
{"reviewerID": "A3J1L5HC0RMCDX", "asin": "B00IKFSSTW", "reviewerName": "Anonymous45 \"michael cifelli\"", "helpful": [6, 7], "reviewText": "My review wont be long and I wont go into historical facts.  One review of another movie put it best. I am going to tell you simply why I liked it. And a few things I think I would have loved to see.  This film has tones of &#34;Braveheart&#34;, &#34;Gladiator&#34;, and the series Spartacus on the premium channel Starz.  This film has maybe two gladiator scenes, and one practice scene. It combines many of the same elements as the movies I mentioned up above. A young child sees his family killed and later as they fast forward 17 years he is a slave and a gladiator. He falls in love with a young lady of worth and good standing.  Unfortunately for him, a corrupt senator wants her to himself.  This is really what the story, at least to me is about.  It's about love, brotherhood forged through being a gladiator, and freedom.  Among these themes is also Mt Vesuvius, Pompeii, and a Tsunami caused by the eruption if I have it correct.  I loved the acting between the two in love, and Kiefer Sutherland was fantastic as the senator.  If your in to special effects then you will or should love this movie. It has it all.  That being said, I think they could have made an epic film, although three hours long to really capture this brilliant story.  I would love to see another series done like they did with Spartacus, only done with this film. Easily a four or five season story with this writing.  If you want to be entertained and enjoy a love story, some fighting but not bloody, along with special effects and some history of what happened to the ancient city of Pompeii then you will love this movie. You cant expect it to be like Braveheart, Gladiator, or Spartacus, only some common themes will be noticed.  I gave it 5 stars for the entertainment value it brought me.  The star of the movie, the gladiator, he is an amazing actor and he played this role to perfection and just made the movie that much better.  So if you want some fun, and something a little different, give this a try.  I don't think you can go wrong in watching it.  I was more then entertained with this movie. Enjoy....", "overall": 5.0, "summary": "Great Entertainment", "unixReviewTime": 1400371200, "reviewTime": "05 18, 2014"},
{"reviewerID": "A3LTZGHZBBBQX0", "asin": "B00IKFSSTW", "reviewerName": "Anthony L.", "helpful": [12, 17], "reviewText": "INGREDIENTS:1. One parts mildly charismatic, ripped, perfectly tanned action hero. British accent required.2. One parts token African ass-kicker.3. One parts puffy-lipped, perfectly coiffed damsel-in-distress.4. One parts good actor hamming it up as agressive bad-guy. British accent optional.5. Two cups sloooooooo-motion and ramping. CGI bloodspray optional.6. One cup Titanic: class-breaking romance on the eve of a terrible disaster.7. One part Gladiator: because GLADIATORS!8. Six parts sweaty six-packs. Use liberally.9. One very, very large volcano.10. One tsunami. Super-size.11. One bag of historical accuracy. Discard without using.PROCEDURE:1. Ripoff every sword-and-sandals movie ever made.2. Put in lots of explosions, collapsing buildings, and slo-motion. This is actually cool.3. Put in a forced, cliched love affair. Season with cheese.4. Suspend disbelief, then take down the remains and burn them.5. Be over the top in the least subtle way.6. BAKE in HOT OVEN. Add side dish of revenge, served cold.SERVES large audience, entertains during action scenes, is silly in the rest. A fun experience, but not memorable. Seconds unlikely...", "overall": 3.0, "summary": "Recipe for a Disaster (movie):", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"},
{"reviewerID": "A2UGR1T0FW89MM", "asin": "B00IKFSSTW", "reviewerName": "April McAbee \"AprilMcAbee .com...Future autho...", "helpful": [0, 0], "reviewText": "This is a terrible movie after watching it I wished I had not wasted the time.", "overall": 1.0, "summary": "Terrible Movie.", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"},
{"reviewerID": "A2PMQH87R1H3QU", "asin": "B00IKFSSTW", "reviewerName": "Benjamin Kidman", "helpful": [0, 0], "reviewText": "I DON'T know what u guys talking about & gives it one or 2 stars  ...I REALLY LIKE THE FLICK,  Visual just STUNNING  AND SPECTACULAR ,NICELY DONE,BRAVOActing was REAL good ..both main actors was done a great job... was burital  with great fight scenes with little love story mix,... Kit Harington ... WAS HOT as F***K in this flick , HE GOT A GREAT TOP NOTCH body and lQQks  ... REALLY Nicely shot and Epic style of movie ...i bought it on blu ray & BLU RAY done in REAL CRISP  IN PQ & AQ ,sharp colors and deep blk & AUDIO DTS-MASTER is GREAT in surround sound system  ....U  have to see it in BIG SCREEN with FULL EFFECTS  surround sound system ,like i have in my screen room .is JUST JAW DROPPING IN VISUAL!!!THE ONLY THING IS they did cuts corners here & there to make it PG-13,U can tell if u watch the movie ...THIS IS should be easily be a R rated movie, because of burital/bloody fight scenes & the story to support that & effects of the movie,for that reason is a BIG let down for me abit!beside that beautifully shot & Epic tell!B+", "overall": 4.0, "summary": "REAL LIKED IT ,*VISUAL IS STUNNING  & JAW DROPPING*, WELL DONE & SHOT!!!!", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"},
{"reviewerID": "A1PJZKEZQGREDY", "asin": "B00IKFSSTW", "reviewerName": "California Dreaming", "helpful": [0, 0], "reviewText": "I always told you that Kiefer Sutherland was One Bad Actor.I mean, after all, everyone knows that if you're going to woo some fair young maiden, there are certain rules of engagement that must be followed, even if a volcano has decided to go all ballistic and ruin the overall mood:1.  Get her some grapes.  After all, grapes were actually very hard to come by back in ancient times and were therefore quite expensive.  And everyone likes grapes.2.  Get her some wine.  Well, wine is made from grapes -- and we already know that those are good, from rule 1 above -- plus wine might make her a little tipsy.  And if she's tipsy, well, she might forgive you a bit for being a ruthless senator.3.  Don't chain her up.  For some reason, women don't like it when their hands are tied to the chariot.  Or the back seat of a limo.  They prefer to go of their own free will and might even change their minds last minute about that engagement when under duress.4.  Don't ever, ever, hit her!  Especially when her hands are tied.  That's just plain bad manners.  Mm-kay?!?And we have a battle for Emily Brown -- Cassia the Princess -- between Mr. Sutherland -- Senator Corvus -- and Kit Harrington -- Milo the Slave -- and so you'd think that this would be a slam dunk for the senator.  I mean, after all, wouldn't you rather hook up with a senator than a slave?  Senators get stuff handed to them, and they usually have lots of money.  Plus, they always get to wear really cool clothes.  On the other hand, slaves actually have to work for a living.  And the only thing anyone ever gives them is a beating.  And forget about cool clothes; they're lucky to be able to wear hand-me-downs from already-dead slaves.  So you'd think immediately that our fair maiden would have an easy choice here.But no!  And that's because this is the movies!  In the movies, even the slaves are better mannered than the senators.  (You know, come to think of it, this still probably holds today.  Hmm.)  Milo's gentle -- unlike Corvus -- and Milo's thoughtful -- unlike Corvus -- and Milo never slaps his women around.  So a contest that should have been a runaway victory here by the senator becomes quite a neck-and-neck horserace.  Unfortunately, like the first paragraph argues, Mr. Sutherland shows that he might just be One Bad Actor.  So guess who wins the princess?Well, you should already know that nobody wins, when you have domestic -- or is that international? -- violence.  Just keep that in mind kids while watching this film that, surprisingly, doesn't quite blow.", "overall": 4.0, "summary": "Domestic -- or is that International? -- Violence", "unixReviewTime": 1400716800, "reviewTime": "05 22, 2014"},
{"reviewerID": "A3RPLCEFOTTVO6", "asin": "B00IKFSSTW", "reviewerName": "ccc", "helpful": [0, 0], "reviewText": "loved it.", "overall": 5.0, "summary": "great show.", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"},
{"reviewerID": "AYWSFRCIMOAYE", "asin": "B00IKFSSTW", "reviewerName": "Cestmoi", "helpful": [0, 2], "reviewText": "The special effects are gripping especially the scene where the lava floods the city.The fighting scenes are exciting.The Love Story does not have enough time to develop.It covers friendship too but it is too brief.The acting is acceptable.I know it does not stick to the true story of Pompeii but I do not care. I just want to be entertained. If I want the facts, I will watch the documentary.In short, it is worth watching once.", "overall": 3.0, "summary": "Gripping Special Effects + Thrilling Fighting Scenes + Acceptable Acting + The Love Story does not have enough time to develop", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"},
{"reviewerID": "ARDNTJLKLIULD", "asin": "B00IKFSSTW", "reviewerName": "Cheeky Monkey", "helpful": [0, 0], "reviewText": "The film is okay.  It has good acting and nice special effects, and a decent story but was lacking something that I can't describe.  I don't know what it is, but it didn't have it.  For a rainy blah kinda day this is a film worth watching on television but certainly not to buy.  It's just an okay film.", "overall": 3.0, "summary": "Okay Film", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A3ULTDERVTUA5D", "asin": "B00IKFSSTW", "reviewerName": "christopher driggers \"Crowdancer\"", "helpful": [1, 2], "reviewText": "I was half hoping for something substantial to develop , but sadly thirty minutes in i almost could predict what the actors were going to do and say.I just found myself yawning and getting up to do other things at home wash dishes laundry etc.I was also hoping for less than obvious dialog and acting but sadly i was left wondering why the heck did i waste my money on this film.Put aside the special effects and you have pretty much nothing .. i tried to sit through the entire film and felt what's the point.", "overall": 2.0, "summary": "Very generic and predictable", "unixReviewTime": 1400198400, "reviewTime": "05 16, 2014"},
{"reviewerID": "A1U5279S68L0XL", "asin": "B00IKFSSTW", "reviewerName": "Day Fan", "helpful": [0, 0], "reviewText": "Full of action and all.  I thought it was a well acted movie.", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"},
{"reviewerID": "ATGCNC2N3SS0L", "asin": "B00IKFSSTW", "reviewerName": "Dina Blythe", "helpful": [0, 0], "reviewText": "Well done.....storyline moves quickly, actors are believable, costumes are fun, and the finale was not overly graphic. I recommend this one to lovers of historical drama.", "overall": 4.0, "summary": "Enjoyable historical drama", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"},
{"reviewerID": "A19AIUXM01VNK9", "asin": "B00IKFSSTW", "reviewerName": "D. L. Maxwell \"reader\"", "helpful": [0, 2], "reviewText": "A fair action movie which morphs into a disaster movie with pretty wild special effects, especially in 3D.  Fight sceneswere generally fair to good and this one would be a pretty fair Saturday evening two popcorn movie.I was really surprised by the good reviews given to Keifer Sutherland for his role.  It seemed to me that he was sleepwalkingthrough the whole movie except when he was channeling his father's (Donald) laid back, sophisticated evil sthick.  Daddy does itbetter.You won't be bored.  Actually, the extras describing the way the director went for accuracy re the city and special effects is worthhalf the price of the DVD.", "overall": 3.0, "summary": "So so", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"},
{"reviewerID": "A2IY9M330NKBW6", "asin": "B00IKFSSTW", "reviewerName": "Eric Sanberg", "helpful": [1, 5], "reviewText": "I don't know if Paul W.S. Anderson is a just a lousy director or maybe it is that he just doesn't know when he's reading a lousy script. Either way this is the next in his line of stinkers.Here's the scoop. Milo (Kit Harington), as a young boy, sees his family and village slaughtered by Roman soldiers. He's put into slavery, raised as a gladiator of exceptional skill and makes his way from the British Isles to Pompeii because it's a better venue. All sorts of things happen to him when he arrives.I simply couldn't believe it. Not only have most seasoned viewers seen this all before, they've seen it better. This lifted elements directly from, &#34;Spartacus&#34; (both the film and the TV series), &#34;Gladiator&#34; and others. You have the young Turk going up against the lifer. The young princess shunning the advances of the Roman upper-up while falling for the lowly gladiator. All manner of political intrigue ensues and a looming volcano set to go off at any minute.The acting is generally good, though Keifer Sutherland was miscast as Corvus, the Roman heavyweight. Carrie Ann Moss had way too small a role. I wonder why she even bothered. Jared Harris could have used a few more lines as well. The directing was decent enough, as were the other production values. This is interesting in and of itself because I didn't recognize the names of any of the main production people. Most of the effects were good but some stuck (stunk) out as suspect. I AM glad they chose a more realistic ending. But by then it was too little too late.I guess there might have been little or nothing that could have been done in trying to write a story around the erupting of a volcano. But I can't imagine this is the best that could be done. This is a waste of time and money. Don't bother.", "overall": 3.0, "summary": "A Cliche Too Far", "unixReviewTime": 1393200000, "reviewTime": "02 24, 2014"},
{"reviewerID": "ADWQPR0LJD4J", "asin": "B00IKFSSTW", "reviewerName": "ERSInk . com \"Eric\"", "helpful": [0, 0], "reviewText": "&#34;Pompeii&#34; came and went in theaters while not making much of a splash along the way. Many blame the release of &#34;The Lego Movie&#34; at the same time for this misfortune. Others blame it on poor word-of-mouth and a lack of interest in the subject matter. Either way, it's arrived on Blu-ray, DVD, and Digital Download guarantees many will give it a second chance in the comfort of their own homes.On the eve of the eruption of Mount Vesuvius, a slave named Milo (Kit Harington) is brought to the great city of Pompeii to participate in the gladiatorial arena. Upon his arrival, he catches the eye of the daughter (Emily Browning) of the city's ruler (Jarred Harris). As the arena battles rage on, the towering volcano begins spewing molten lava and raining fiery rock onto the citizens of the ancient metropolis. In the midst of all the confusion and destruction, Milo escapes and finds himself leading the ruler's daughter to safety as the city crumbles around them.First off, if you're walking into &#34;Pompeii&#34; expecting complete historical accuracy you're setting yourself up for disappointment. Keep in mind that it is a Hollywood film. Although Director Paul W.S. Anderson went to great lengths to make the eruption of the volcano and the layout of Pompeii as authentic as possible, he himself even admits that the story and other scientific elements aren't completely precise.What Anderson and Writers Janet Scott Batchler, Lee Batchler, and Michael Robert Johnson do is build up a few characters the best they can in a movie with a running time of an hour and forty-four minutes. If this were an old-school 1970's disaster film, they would've made it over two hours long and spent the first hour and a half getting the audience acquainted and invested in all the lives of the people seen onscreen. In a world where there has to be an explosion every four to five minutes or viewers lose interest, that's just not possible.The cast of &#34;Pompeii&#34; seems legitimately interested in participating in the movie. Leads Kit Harington and Emily Browning both fit their roles of star-crossed lovers quite well as they gaze into each other's eyes from afar and Harington risks life and limb to save Browning from certain doom. Kiefer Sutherland chews the scenery every chance he gets as the deplorable Roman Senator Corvus.All the explosions and fiery destruction is beautifully enhanced by a high-definition transfer for &#34;Pompeii's&#34; Blu-ray release. The surround sound puts the viewer in the middle of all the mayhem, leaving little to the imagination as earthquakes rumble loudly and flaming boulders scream through the sky before crashing into the city. Movies like this are what home theaters were made for.The Blu-ray for &#34;Pompeii&#34; is packed full of bonus material that will educate viewers on what went on behind the scenes of the film. Filmmakers provide commentary for the feature. Six featurettes focus on the special effects, cast and characters, stunts, production and costume design, and a historical view of the last days of Pompeii. Deleted and alternate scenes are included as well.&#34;Pompeii&#34; is rated PG-13 for intense battle sequences, disaster-related action, and brief sexual content. Plenty of people die horrible deaths in the movie for all to see. Some die bloody deaths as gladiators while others perish from being buried in volcanic debris. The &#34;brief sexual content&#34; refers to scenes of women shopping for slaves to have their ways with them and some passionate kissing between characters.As a fan of disaster films, &#34;Pompeii&#34; successfully met my expectations. It's not often you can find a way to blend together the destructive elements of &#34;Armageddon,&#34; &#34;The Poseidon Adventure,&#34; &#34;Earthquake,&#34; and &#34;The Day After Tomorrow&#34; into one movie. When you add a hefty spoonful of &#34;Gladiator&#34; to the concoction, there's not much more you can do to satisfy the hunger of action movie fans anywhere.", "overall": 4.0, "summary": "Paul W.S. Anderson's disaster epic 'Pompeii' comes home on Blu-ray", "unixReviewTime": 1402876800, "reviewTime": "06 16, 2014"},
{"reviewerID": "A1LYQL40IB7SBL", "asin": "B00IKFSSTW", "reviewerName": "FNDNreview", "helpful": [3, 7], "reviewText": "The disaster of the city of Pompeii took place in the year 79 AD and has really become more of a tragic legend than fact.  Although historians are aware of the time frame in which the volcano, Mount Vesuvius, erupted &#8211; along with having some names of people that died in the catastrophe &#8211; that&#8217;s really all they know.  With that in mind, the imagination and fictitious accounts make up the storyline for the period adventure flick, Pompeii.Paul W. S. Anderson (Resident Evil, Mortal Kombat) directs the epic, Pompeii &#8211; starring Kit Harington as Milo.  As a young boy, Milo watched as the Romans slaughtered his people (and parents), led by a dastardly soldier, Corvus (Kiefter Sutherland).  Although Milo survived the attack, he was captured and thrown into slavery, eventually becoming a lethal gladiator.  In fact, he&#8217;s so lethal that his master, Graecus (Joe Pingue), decides to move him to a grander stage in the city of Pompeii.On the way to Pompeii, the lives of Milo and a wealthy merchant&#8217;s daughter, Cassia (Emily Browning), become intertwined.  Shortly thereafter, Milo learns he must fight Pompeii&#8217;s gladiator champion, Atticus (Adewale Akinnuoye-Agbaje) &#8211; but prior to their showdown, the two men form a surprising and unsuspecting friendship.  At the same time, the man that killed Milo&#8217;s family, Corvus, comes to town and is now a well-respected (and feared) Roman senator.Corvus has been looking for Cassia (whom he desperately wants to marry) and quickly notices the growing bond that has formed between Cassia and Milo.  In an effort to dispose of Milo, Corvus puts both Atticus and Milo in the Pompeii coliseum for the fight of their lives &#8211; a fight in which they are sure to lose their lives.  However, without any warning, a volcano outside the city erupts thrusting everyone into a panic as the sky rains with fire and ash.For the fans of the popular film, Gladiator, the plot of Pompeii will appear to be extremely familiar.  Both feature a storyline that is driven by revenge after the death of the main character&#8217;s family.  But, Pompeii is certainly no Gladiator and the fact that both films are being used in the same sentence is borderline outrageous.  Still, it&#8217;s hard to ignore the similarities between the two movies &#8211; prompting Pompeii to easily be labeled as a dreaded Gladiator &#8220;knockoff.&#8221;Kit Harington, who is most recognizable from his starring role in the popular HBO drama, Game of Thrones, plays a character that we&#8217;ve seen countless times in the past &#8211; and again is much like the lead character in Gladiator (although Harington is a far cry from the masterful Russell Crowe).  Milo is cold as ice on the outside, but clearly filled with righteous emotions on the inside.  He&#8217;s been driven by revenge his whole life, but once he lays his eyes on the beautiful &#8220;princess,&#8221; suddenly his heart melts and he has new meaning to live.If you happen to be a fan of Jon Snow (Harington&#8217;s Game of Thrones character), then you should find just as much enjoyment in the Milo character.  Harington literally looks like he walked of the set of Game of Thrones and jumped right into Pompeii.  In fact, the two characters are so similar that it will be almost impossible to tell them apart.  Unfortunately, it&#8217;s difficult to determine whether or not that&#8217;s a good thing or a bad thing.  Really, the only bothersome part of Harington&#8217;s character in Pompeii is that it&#8217;s filled with far too many holes since viewers will have no idea what happened to the character from childhood to adulthood &#8211; although one could assume he was constantly in chains.The main character depth issue, which plagues many films that have previously attempted to do too much in too little time &#8211; evident in films like John Carter and Prince of Persia, also hampers Pompeii.  Several lead characters, like Emily Browning&#8217;s Cassia or Kiefer Sutherland&#8217;s Corvus, are nothing more than randomly in the wrong place at the wrong time &#8211; sort of like anyone that was aboard the Titanic.  Sadly, the ambitions of these two vague, aloof characters are never fully realized, and are poorly reduced to taking part in an under whelming love triangle.Storyline aside, the CGI is also an issue that takes away from the film.  For roughly the first half of the film, the actors are mostly able to avoid the dreaded green screen.  However, as the volcano begins to erupt and the coliseum fighting ensues, the CGI becomes unbearably frequent &#8211; and is about as believable as the CGI used in Paul W. S. Anderson&#8217;s Resident Evil films.  If you&#8217;ve sat through other disaster flicks, like 2012 or Armageddon, then Pompeii will give off a similar feeling of disappointment with the over abuse of computer graphics.Overall, Pompeii is a film that will appeal more to Game of Thrones lovers and moviegoers that enjoy gladiator tales.  The story is far from unique, but that doesn&#8217;t stop it from being a semi-entertaining adventure flick.  It progresses at an intense pace and features plenty of action (even though most of it is noticeably fake).  Everlasting love is apparently the theme of the story, but by the time the credits roll, I suspect most viewers will feel as though they wasted their time watching a film that is filled with nothing more than death, disappointment, and shattered expectations.  $100 million is far too much to spend of the movie of this nature and even though it is an average &#8220;popcorn&#8221; film, the disappointing finale will leave the majority of viewers uttering, &#8220;that&#8217;s it?&#8221;GRADE:  C-FNDNreview.com", "overall": 2.0, "summary": "'Pompeii' tragic in more ways than one.", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"},
{"reviewerID": "ACBMCM7S32FZX", "asin": "B00IKFSSTW", "reviewerName": "Greg A.", "helpful": [0, 0], "reviewText": "I'm not sure how any of these actors signed on to the project with the script they were given to read. The whole plot was a failed attempt at plagarizing every other &#34;forbidden love&#34; scenario ever seen in movies. The destruction was on par with the movie 2012, and really, it was the destruction you rooted for in the end. Oh, and when you get to the part about the chariot racing down the street, ignore the little things like how a 4 horse chariot could miraculously find a completely empty, near-debris-free road, or how it could outrace an earthquake, or even how it could make such a sharp turn that even most cars would flip on their sides to make. Ya...good script there....Like I mentioned in the title line, just mute the sound, turns the caps off, and enjoy the C.G.I. In the end I rooted for the volcano...and somehow I just don't think that was the feeling I should have been asked to feel. The movie did nothing to honor any of those lost to such a horrific death.", "overall": 2.0, "summary": "Mute the dialog and enjoy the destruction.", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"},
{"reviewerID": "A1KIQ4P4ZW3ALF", "asin": "B00IKFSSTW", "reviewerName": "G. Teslovich", "helpful": [3, 4], "reviewText": "Dialogue & acting - dialogue is changed from 1st century Italian into 18th century old English by Hollywood. A common dialogue found in many of their period movies no matter what century or country. Acting was daytime soap TV level.Characters - noncreative, plug and play characters e.g. gladiators (one black), soon to become friends with main character (done before); his counterpart sees his parents die at Roman hands and is now old enough for revenge (done before); evil Romans acting badly; aristocratic pretty daughter (still has 21st century make up, eye liner, etc.) falls for  gladiator (of course).Action scenes -  good gladiators defeat dozens of Romans as brunch (I was waiting for one hand tied behind the back and blindfolded but the writers copped out). Not realistic.CGI - flashes of CGI volcano every 5 to 10 minutes to remind us of what the movie is about. Familiar scenes of water rushing over the city - already used in many tsunami movies. Looked like the same wave used in several recent Indian Ocean tsunami films, but not as well done as say in \"The Impossible\". Comical volcano Roman Candle fireworks fireballs.", "overall": 1.0, "summary": "Outside of some effects - just bad.", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"},
{"reviewerID": "A2CYULPE4Z76BJ", "asin": "B00IKFSSTW", "reviewerName": "Holly Billick", "helpful": [0, 1], "reviewText": "Kit Harington. He was the reason that I saw this movie. Mostly a bare chested Kit Harington, but I still liked it. I knew the basic story of Pompeii, but I knew enough to know that the majority of people died. I liked it. . . what can I say.", "overall": 4.0, "summary": "Guilty pleasure", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"},
{"reviewerID": "A3IXZJ1L73DYTA", "asin": "B00IKFSSTW", "reviewerName": "Jack E. Levic", "helpful": [0, 1], "reviewText": "It's interesting to think about life in POMPEII on the fateful day Mount Vesuvius errupted and ended life in the thriving city. The movie POMPEII caught my attention and I was imagining a somewhat historical tale of love and life in the time of disaster.It seemed like the filmmakers took the idea of a volcano errupting and worked a fantastical tale around it that is as ordinary as they come. Gladiator slave falls in love with rich beautiful young lady who is pursued by an evil politician.  There is so much to tell about POMPEII and the lives of ordinary citizens and the frantic desperate moments when they realized they were doomed.Buffed and chisled Kit Harrington loses his family in Britain and ends up in Pompeii as a slave who is fighting gladiators in the arena. He's again Jon Snow from GAME OF THRONES only in a different setting and time period. He does his best and lovely Carrie-Ann Moss always is worth watching. Maybe more of their love story in a different setting would have been more exciting.Kiefer Sutherland is the evil Roman Senator and Sutherland plays his character with some sort of stilted Briish accent. Why do characters set in ancient Roman times always speak with British accents?It seems like POMPEII has a sprinkling of the STARZ series SPARTACUS with its gladiator theme. The main action begins in the last part of the film as Mount Vesuvius finally errupts. Here is where the real story should be given more attention as terrified and desperate people are trying to escape while others are resigned to their fates.I watched the bonus feature about the volcano and the filmmakers say they followed the writings of Pliny the Younger who was a witness to the disaster. They said they followed Pliny's description of the erruption and the effects on the Bay of Naples. Imagine people trying to flee by ship on the unforgiving waters.  Here would be a fascinating story and it is addressed to some degree. Some of the visual effects are great. Others look fake.An attempt was made to tell an interesting story in the time of disaster but the whole film falls apart.", "overall": 2.0, "summary": "WEAK STORYLINE BUT SOME NICE VISUALS", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"},
{"reviewerID": "A3JBLXCH954NMV", "asin": "B00IKFSSTW", "reviewerName": "Jared M. Kuntz \"wakingupin528\"", "helpful": [92, 108], "reviewText": "Pompeii is the new disaster film from Paul W.S Anderson about, you guessed it, Pompeii! Following the story of Milo (Kit Harrington), a Celt who was put into slavery after his village was attacked and his parents killed, Milo becomes a gladiator, fighting numerous foes within area walls. But it's in Pompeii where Milo's destiny will come to light, falling in love with Cassia (Emily Browning), the daughter of Pompeii's ruler Severus (Jared Harris), and befriending a rival gladiator, Atticus (Adewale Akinnuoye-Agbaje). But when Mount Vesuvius begins to tremble and plumes of smoke and ash fall upon the great city, Milo, Atticus and Cassia must escape the city before they are buried by the mountain.Pompeii isn't a bad movie; it really isn't. The only reason why i gave it four stars (I would give it 3.5 stars if there were an option) is because of all the poor reviews. Anderson's directing here is actually his best to date, better than his Resident Evil films, The Three Musketeers reboot and Event Horizon. His script, on the other hand, was disappointing. It's not that it was poorly written, it's just that there isn't anything new whatsoever. The visual effects were great, but not award-winning. The acting was a mixed bag. Kit Harrington was surprisingly static in the heroic lead role, being uninteresting and the stereotypical hero, but his acting helped keep the character from being completely lifeless. Emily Browning was good as Cassia, but nothing note-worthy. Kiefer Sutherland was actually great as the secondary protagonist, Senator Corvus, the man who killed Milo's mother. He was truly corrupt in his role, and a character you wanted to die horribly (which is good). But it was Adewale Akinnuoye who stole the show as Atticus. An emotionally complex and heroic character that is built around courage and strength, and the sad thing is, he gave an Oscar and Golden Globe worthy performance for a film that deserves neither. I really don't know why he wasn't the lead role, because the film would have been better if he was. The cinematography was good, echoing the greatness of this lost city, and the musical score was fantastic; a mix of Hans Zimmer's King Arthur and Marc Streitenfeld's Robin Hood.Pompeii is a seriously underrated blockbuster that deserves better ratings, but is not classic-worthy material. I'll purchase it when it comes out, though, because it's still a good movie. Also, another thing that makes the film stand out is that it is factually accurate in terms of the volcanic eruption; yep, even the tsunami.3.5/5 Stars", "overall": 4.0, "summary": "A Fun, Intense and Emotional Blockbuster", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"},
{"reviewerID": "A10H47FMW8NHII", "asin": "B00IKFSSTW", "reviewerName": "Jay B. Lane \"professional audience member\"", "helpful": [1, 4], "reviewText": "Okay. It's a new year so I can have a new WSF (Worst So Far), although I'm sure there will be even worse as the year goes on. As a rule, I find most clich&eacute;d situations to be diverting, but not the groaners in this thing. I'm sure the gales of laughter that met the finale were NOT what the director had in mind! (To be fair, sometimes a screening audience IS a tough sell.)Director Paul W.S. Anderson (&#34;The Three Musketeers&#34;) specializes in Computer Generated Imaging, so this actioner contains no surprises, but this bloodbath piled cruelty upon cruelty: lashings, bashings, smashings and slashings, so I kept my eyes covered and my yawns smothered much of the time. How many ways can they draw blood or cause mental anguish? (One couple actually brought a toddler. Okay, no profanity, so no harm.....)These folks have had better roles, but they give it their best:* Adewale Akinnuoye-Agbaje (&#34;Thor: The Dark World&#34;) has our sympathy as the gladiator promised his freedom if he wins his last fight. Yeah... right...* Kit Harington (&#34;Game of Thrones&#34;) is our hero, a Celt with uncommon fighting skills, enslaved by Roman soldiers since childhood. Of course it's love at first sight when our heroine makes her entrance.* Emily Browning (&#34;Sucker Punch&#34;) is that puffy-lipped heroine. She is betrothed (unwillingly) to a Roman senator by her less-than-courageous father.* Jared Harris (&#34;Mad Men&#34;) is that father, who apparently backed the wrong politician and now has to make amends to the current powers that be.* Carrie-Anne Moss (&#34;Vegas&#34;) is his wife. At least she can see the political scene clearly, although there is very little she can do about it.* Kiefer Sutherland (Lots of TV) is the dastardly senator from Rome who lusts after our heroine and wants to invest in real estate in our fair city. (Pompeii was considered a resort town by the Romans.)No fight is worth watching unless there are insurmountable odds (which of course our hero surmounts) and lots of blood. And we only HEAR him break that horse's neck....I don't remember archaeologists mentioning a tsunami, do you? I thought it was pyroclastic (searing) blasts and ash-fall from Mount Vesuvius that killed the good folks in Pompeii. This morning I contacted someone who toured Pompeii and never heard a word about a tsunami. By the way, the plaster casts we associate with Pompeii were created when archaeologists injected a substance into the hollows in the solidified ash which were left after corpses decomposed.Expect lots of swordplay, spear thrusts, fist fights, earthquakes, a volcanic eruption, and a tsunami. Only one chaste little kiss though, and no sweaty bodies (PG-13). Whew!", "overall": 2.0, "summary": "A Tsunami?", "unixReviewTime": 1392940800, "reviewTime": "02 21, 2014"},
{"reviewerID": "AM0Q2JUS910ZQ", "asin": "B00IKFSSTW", "reviewerName": "JEROME W, MARTIN", "helpful": [0, 1], "reviewText": "I am a great fan of movies that deal with historical happenings, even if much liberty is taken with the films.  I am also an Historicalnut when it come to Roman History.  This movie is awfull...YES AWFULL!!  The history is shoddy, the cast lousy, and the actingterrible. Just another Roman bashing movie.  For one thing, the population (free men) were all Roman Citizens.  This film seemedto say they were not.  And any time anybody makes a film about Rome (from Hollyweird) the Romans are all evil and contributednothing to Western Civilization. The US constitution is in large part based in the Roman Republics constitution, even the architecturein DC is primarily Roman or styled after Roman buildings.  How about Roman Law, the basis of European and US law.  There aremany things I could mention but I should continue about this movie.  The story was STUPID, STUPID, STUPID!!!  I only gave thismess 2 stars (I was being generous!) because of the fine special effects, the reasonably accurate sets and the volcano eruptions.I will probably keep the DVD only because of the effects.  I did get this from Amazon.  I also got the 1984 version of  THE LASTDAYS OF POMPEII and will review it later when I finish.  Allready it seems much better, at least in story.  So if you like excellentspecial effects and like to watch a Roman city leveled, then I would reluctantly rent or buy the movie. But you better by someclothespins for your nose.  Or just scan ahead to the good parts.  enjoy!", "overall": 2.0, "summary": "A REAL STINK-A-ROO", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"},
{"reviewerID": "A1X1CEGHTHMBL1", "asin": "B00IKFSSTW", "reviewerName": "jjceo", "helpful": [0, 0], "reviewText": "This is an entertaining movie but certainly not a classic. Aside from the fact that Pompeii was destroyed the balance of the story is fictional and a mediocre copy of the movie Gladiator.Kiefer Sutherland is not my favorite actor and he did another poor job in this film by overacting. I like the characters of the Celtic gladiator and the daughter of the leader of Pompeii.I rate the film as a 3 star for entertainment. Rent it and watch it but don't buy the DVD IMHO.", "overall": 3.0, "summary": "Pompeii covered in volcanic ash along with this film!", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"},
{"reviewerID": "A3F8T3BRXRX5P3", "asin": "B00IKFSSTW", "reviewerName": "JWink", "helpful": [0, 0], "reviewText": "Pompeii tells the story of a slave-turned-gladiator finds himself trapped in a city being destroyed by a volcano.The biggest issue I  have with the movie is that it isn't sure what exactly it wants to be... It is a gladiator remake, a love story, or a disaster movie.  The visual effects and scenery are well done and the city detail was done very well but  the plot of the movie seems to be a combo remake of Gladiator and Titanic which seems to muddle both stories especially considering we all know the volcano blows up and destroys the whole city and everyone in it.The special effects are done well though especially when it comes to the volcano and the destruction of the city at the end of the movie.The movie is ok to watch with its disaster type situation that makes it interesting enough to entertain you but the generic love story and Roman versus Horseman subplot make this movie lesser than the sum of its parts.", "overall": 3.0, "summary": "Ok to watch", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "AFOHUSVNZZ49W", "asin": "B00IKFSSTW", "reviewerName": "K. Reynolds", "helpful": [1, 2], "reviewText": "IT&#8217;S A little bit historical romance, a little bit gladiator adventure, and a whole lot of disaster film &#8211; but what could we expect from a movie about the destruction of Pompeii?This slice of history is as fascinating as the sinking of the Titanic and well-suited to the 3-D format. In 79 AD, the seaside town of Pompeii and its citizens, just outside of Naples, were destroyed by the eruption of Mount Vesuvius. In the multi-part making-of extra included on the Blu-ray, we learn the city was also hit by a massive earthquake and tsunami. And director Paul W.S. Anderson, best known for his &#8220;Resident Evil&#8221; movies, shows it all in the space of 105 minutes &#8211; just a tad over 90.It&#8217;s everything an action-fan could hope for, especially in 3-D.We could swear we were watching a Roland Emmerich film. The king of disaster movies, Emmerich is known for &#8220;Independence Day&#8221; and &#8220;The Day After Tomorrow.&#8221; Opening scenes, where our hero&#8217;s family is killed in the Roman slaughter of a village in Britannia, might lack the 3-D pop test, but the rest of the film is packed with engaging visual depth that continues throughout. As expected, the volcanic explosion brings hundreds of rocks, flames and ash into the home theater. And the &#8220;Gladiator&#8221;-type fight sequences are worth the 3-D price.Yep. &#8220;Gladiator.&#8221; Even Anderson and his posse admit they lifted a big chunk of inspiration from Ridley Scott&#8217;s film. Kit Harington, Jon Snow of HBO&#8217;s &#8220;Game of Thrones,&#8221; plays Milo, the lone survivor of the Britannia massacre. Milo is only a child when he becomes enslaved, but grows up to become an unbeatable gladiator known as The Celt. Driven by vengeance, his skill leads him to the arena in Pompeii, described as the Las Vegas of Ancient Rome. It&#8217;s where rich Romans had their seaside villas, Anderson tells us. Pleasurable activities &#8211; like watching men kill each other for sport &#8211; were the mainstay of the resort town.Milo arrives in town, bound for the arena, as Vesuvius begins its death dance. Warning signs are everywhere &#8211; earthquakes, killer geysers, sudden sinkholes. Among the deleted scenes, we find a priestess pronouncing bad omens. No one heeds her warnings &#8211; and her prophesies certainly aren't needed for the audience. We know the score.Milo meets a young woman, the beautiful Cassia (Emily Browning), on the road and its fate/love at first sight. A citizen of Pompeii, Cassia is fleeing back home to escape the attentions of Roman Senator General Corvus, who was responsible for killing Milo&#8217;s people. He is played with panache by Kiefer Sutherland, who talks about how much he enjoyed played a bad guy for a change. No one &#8211; not even Browning &#8211; has better costumes than Sutherland, who wears those cloaks and medallions as if he were born to the purple. We also get to see Sutherland display some remarkable horsemanship, delivering dialogue on horseback. The scene was originally written with his character dismounting. However, Sutherland advised he could remain mounted and hit his marks &#8211; and he does.Speaking of costumes, they look spectacular in HD detail, as do the amazing sets, which also look great in 2-D. Anderson has long been fascinated by Pompeii, its tragedy and its rich culture. History enthusiasts should appreciate the effort put into making the spectacular look &#8230; spectacular! Sound is also excellent, completely immersive with terrific surround-sound range.The commentary with Anderson and producer Jeremy Bolt held my interest throughout; details include production as well as historical info. Making-of extras also feature interviews with the leads, costuming with designer Wendy Partridge, and the actors&#8217; gladiatorial training.No &#8211; characterization isn't deep and there&#8217;s nary a trace of levity throughout, but I enjoyed this escape into history. Chances are, with a big bowl of popcorn, you will, too.  &#8212; Kay Reynolds and Bill Kelley III", "overall": 4.0, "summary": "Bringing down the house ... and everything else!", "unixReviewTime": 1402704000, "reviewTime": "06 14, 2014"},
{"reviewerID": "A8LL0UL6IQRZP", "asin": "B00IKFSSTW", "reviewerName": "lee", "helpful": [1, 3], "reviewText": "Cheese, cheese, cheese, and more cheese than you ever imagined was possible in a short few hours of cheese.  Cheese.", "overall": 1.0, "summary": "Doesn't get worse than this", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "A2DAHERP7HYJGO", "asin": "B00IKFSSTW", "reviewerName": "Mark Turner", "helpful": [0, 0], "reviewText": "It wasn't all that long ago or at least it feels that way, that Hollywood suddenly remembered the sword and sandal films of the sixties and began making them all over again. There were some great films made too, in particular GLADIATOR and TROY. Then the genre died out again or found itself taken over by ridiculously low budgeted reproductions of those popular films. It went back to the shelf. Now director Paul W.S. Anderson tries to bring it to life again with POMPEII. Unfortunately the film falls somewhere between those two types of films, the good and the bad.The story revolves around Milo who as a child watches as his parents and entire tribe of Celt horsemen are slaughtered by the Romans led by General Corvus (Keifer Sutherland) and his right hand man Proculus. Pretending to be dead, young Milo climbs from under the bodies of those who were slaughtered only to later be captured and placed into slavery.Years go by and Milo (Kit Harington) grows to be a fighter in ancient Britannia. When he catches the eye of one of the promoters for gladiatorial fights in Pompeii, he is taken back to that ancient city. Along the way he encounters Cassia (Emily Browning) when one of the horses pulling her carriage falls. He catches her eye not just because of his looks but because he puts down the horse in the most humane way possible.Cassia gets to Pompeii before the slaves on their way. It turns out that her father Severus (Jared Harris) is the ruler of the city. Severus is trying to promote the city into a minor version of Rome and is aided in doing so by his wife Aurelia (Carrie-Anne Moss). While pleased to see their daughter home once more they have yet to find out why she came back from Rome. That is explained later when now Senator Corvus arrives to negotiate with Servus for assistance to rebuild the city. Of course, he uses his desire to marry Cassia to eventually seal the deal.Meanwhile Milo finds himself in the slave quarters of the gladiators and a target of another slave whose brother he killed. While he survives that the odds of his surviving the arena are slim, even more so when the plan is to have him face off against his cell mate Atticus (Adewale Akinnuoye-Agbaje), a slave who is about to win his freedom if he defeats his 19th opponent. The pair square off during practice when an attempt is made once more on Milo only to be stopped by Atticus. While each knows they will one day face off against one another in the arena, a bond develops between the two.In the background of these stories is the mountain that rises above Pompeii that seems to be developing into eruption mode. Since we know the story of Pompeii there is little suspense formed by this except wondering just when it will finally blow.A change in plans in the arena has Milo and Atticus united to face off against the Romans. It's at this time that Corvus makes known his intentions for Cassia to her parents. It also happens to be when things begin to happen with the mountain filling the next 30-40 minutes with tons of special effects and carnage. Even with all of that happening a final face off between good guys and bad must take place.Shot using tons of green screen the movie does a good job of making you believe you're looking at an ancient city, but then again used as much as it is your belief starts to dwindle after a while. The explosive effects of the last portion of the movie are well made but at the same time stretch your ability to suspend belief as the main characters all just fall short of being engulfed in flames, fireballs, earthquakes or floods.The acting has no standouts here and is fair for the most part. Surprisingly the one performance that disappointed me the most was from Sutherland whose English accent in a movie set in ancient Rome falls flat. Browning's performance as Cassia lacks the depth and believability to carry off the story. Part of that is due to the love at first sight story telling that has her fall for Milo without any hesitation whatsoever.On the whole POMPEII isn't a terrible movie but it isn't a really good one either. It's one of those movies you probably won't be too disappointed in seeing if you like the genre, but not one that you'll want to revisit again after watching. As I watched the movie I kept thinking back to how great movies like SPARTACUS and GLADIATOR really were. When you think of another movie you want to see again while watching the one in front of you, it's not a sign of how good that movie is.", "overall": 2.0, "summary": "SO SO SWORD & SANDAL", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A17LEYMZI8OYOQ", "asin": "B00IKFSSTW", "reviewerName": "Michael B. Druxman \"A Good Story is a Terribl...", "helpful": [1, 2], "reviewText": "&#8220;TITANIC meets GLADIATOR with a volcano!&#8221;That&#8217;s the way that some folks have described , recently released to home video by Sony Pictures Home Entertainment.I can&#8217;t really disagree with that basic assessment, nor can I dispute the fact that, upon the film&#8217;s theatrical release earlier this year, neither the press reviews nor the movie&#8217;s box-office were anything to get excited about.  On the other hand, I found the movie to be quite entertaining.Certainly POMPEII is no classic.  The basic love story is filled with clich&eacute;s, mirroring Titanic, except that in this instance the characters are trying to escape an erupting volcano rather than a sinking ship.  The action sequences are well staged and exciting and the CGI recreation s of ancient Pompeii, the climactic eruption, earthquake and tsunami are truly spectacular.  In other words, this movie is fun.Kit Harington stars as a slave turned super gladiator, who falls in love with the daughter (Emily Browning) of a wealthy Pompeii merchant.  She is being wooed by a corrupt Roman Senator (Kiefer Sutherland), and he just happens to be the man who, years ago, killed Harington&#8217;s parents.  As Mount Vesuvius erupts, destroying everyone and everything in the vicinity, Harington must fight his way out of the gladiator&#8217;s arena, so that he can rescue Browning from Sutherland&#8217;s grasp.Directed by Paul W.S. Anderson, the epic film&#8217;s splendid cast includes Carrie-Anne Moss, Adewale  Akinnouoye-Agbaje, Jessica Lucas, Jared Harris and Currie Graham.The 2-disc 3D/Blu-Ray/Digital combo-set from Sony includes many extras: filmmaker&#8217;s audio commentary, 20 deleted and alternate scenes, plus several &#8220;Behind the Scenes&#8221; featurettes that cover virtually all aspects of the production (e.g. special effects, casting, production design, costuming, etc.). Michael B. Druxman", "overall": 3.0, "summary": "TITANIC meets GLADIATOR with a volcano", "unixReviewTime": 1400025600, "reviewTime": "05 14, 2014"},
{"reviewerID": "AHXV3DA6QJRPY", "asin": "B00IKFSSTW", "reviewerName": "Michael J. Scott", "helpful": [0, 1], "reviewText": "I am a big movie fan.  Love movies and go regularly.  I had high hopes for Pompeii, but about 30 minutes in I realized this was a real turkey.  There was nothing factual about it, nothing that I could see.  A stupid love story was the focus of the story, while a volcano was coincidentally erupting in the background.  I cannot recommend this flick unless you choose to sit down and smoke a little pot and watch it with friends who have great senses of humor.", "overall": 1.0, "summary": "Likely one of the worst movies ever", "unixReviewTime": 1401408000, "reviewTime": "05 30, 2014"},
{"reviewerID": "A2F9M70D2CYNZ1", "asin": "B00IKFSSTW", "reviewerName": "MM", "helpful": [0, 0], "reviewText": "Really enjoyed the history lesson in this film. If you have been to Pompii and walked the streets this film brought it all to life. Kit Garington was great.", "overall": 5.0, "summary": "Pompii", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"},
{"reviewerID": "A25GAS44MY1ARA", "asin": "B00IKFSSTW", "reviewerName": "NC. movie man", "helpful": [0, 5], "reviewText": "It is worth seeing but not at theaters, I really would have given it 4 and 2/10 stars because the only real reason is action was at  the last 15 minutes for that I take away one star. 8/10 because I saw one made for TV that had a better story line it was about the rich and the poor not about  Gladiators to me that's old hat. The TV movie the rich ran to a basement room the poor followed,even when they knew they were about to die the rich made the poor sit across the room from them without so much as a hello. if it ever becomes free with prime I'll  watch this one again.", "overall": 3.0, "summary": "Worth seeing", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"},
{"reviewerID": "A2K62IHNYD9CBR", "asin": "B00IKFSSTW", "reviewerName": "norma jean kringer", "helpful": [0, 1], "reviewText": "I thought this was about a volcano and chance of survival.  Gladiator vs. gladiator just didn't match the movie.  A waste of my time.", "overall": 2.0, "summary": "Huh?", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"},
{"reviewerID": "A7DAL9PK7F4M1", "asin": "B00IKFSSTW", "reviewerName": "Paul Donovan \"Paul Donovan\"", "helpful": [226, 248], "reviewText": "Nine Things About the Movie &#8220;Pompeii&#8221;1. The only thing that most people know about Pompeii is that it was an Italian city destroyed by a volcano and buried in ash a long time ago. So this movie makes up the rest of the story.2. The plot of the movie is as generic as you can get. You can almost hear the filmmakers say, &#8220;Well, the event happened in gladiator times. And it&#8217;s about a bunch of people who can&#8217;t escape where they are and they all get killed. So let&#8217;s make &#8216;Gladiator&#8217; meets &#8216;Titanic&#8217;. And even though it&#8217;s in Italy, let&#8217;s make everybody talk with a vague sort-of-British accent.&#8221;3. And that&#8217;s exactly what they did. It&#8217;s your basic poor-boy/rich girl story. It&#8217;s about a boy named Milo that is captured in war, becomes a slave, and then is sent to Pompeii to fight as a gladiator. While there, he meets Cassia, the daughter of the city ruler. They fall in love. Her dad is upset. The usual.4. Meanwhile, the volcano starts acting up. For some reason, it only happens at night, like the volcano was some serial killer, and people start disappearing.5. Besides the love story, there is a half-baked political subplot.. Since we all know how the movie ends, the story is not only silly, it&#8217;s pointless. There&#8217;s no reason to care much about the characters.6. The last half-hour of the film is all about the destruction of the city. It&#8217;s pretty cool to watch, and the 3D effects are well done.7. The director did take a lot of time to make the city itself historically accurate, basing it on studies of the actual ruins. Historians give the movie points for this.8. Scientists who study volcanoes say that the depiction of the volcano is also historically accurate, except for when it rains fireballs.9. This is a simple, old-fashioned disaster movie that offers nothing special in terms of story, but is fun to watch.", "overall": 3.0, "summary": "pointless but fun", "unixReviewTime": 1395187200, "reviewTime": "03 19, 2014"},
{"reviewerID": "A2U4M72CSWCF8X", "asin": "B00IKFSSTW", "reviewerName": "Ramona", "helpful": [0, 0], "reviewText": "Terrible script.  Good actors wasted.  Okay for a rainy afternoon or boring night, but don't expect much.  Question the accuracy of the explosion.  I was taught there was no time, that people were caught eating their meals and frozen in time.  Wouldn't make much of a movie then, maybe.", "overall": 3.0, "summary": "mofd like 2.5 stars really", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"},
{"reviewerID": "A3I291BE0RNZCU", "asin": "B00IKFSSTW", "reviewerName": "Rating My Best Pick", "helpful": [0, 0], "reviewText": "I should have listen to all the reviews that gave this movie 3 stars. I'm not saying the movie was trouble ,but it was torn between sweet and bitter moments of intresting tales of 19centry AD. I felt that the writters; of this movie could have delivered a little more to keep the audience near the screen. Hopfully, it will be a remake of &#34;pompeii&#34; like they remade the movie &#34;Hercules&#34; 3 stars is sufficient for this movie and nothing more. I was expecting a great deal more!", "overall": 3.0, "summary": "Bitter Sweet movie!", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"},
{"reviewerID": "A6T098A9B0GZC", "asin": "B00IKFSSTW", "reviewerName": "Robbi Dobbi \"Quality, Value, Community!\"", "helpful": [1, 1], "reviewText": "My x-wife wanted to see it so we got the chips and dips and gave it a go. Nice scenery and thrilling tale. Excellent gladiator fights. Cool volcano explosions and computer graphics work.", "overall": 4.0, "summary": "It was worth watching...once....", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"},
{"reviewerID": "A19ZXK9HHVRV1X", "asin": "B00IKFSSTW", "reviewerName": "Roland E. Zwick", "helpful": [0, 0], "reviewText": "Paul W. S. Anderson's &#34;Pompeii&#34; is a throwback to all those sword-and- sandal epics of yesteryear that combined period-piece spectacle with generous dollops of bloodletting, action and romance. This 1st Century soap opera just happens to take place in the shadow of Vesuvius, the volcano that famously erupted in 79 A.D., burying much of the city and its inhabitants in tombs of molten rock and ash.Looking like he barely needed a change of wardrobe from his day job, &#34;Game of Throne's&#34; Kit Harrington plays Milo, a Celtic boy who, after he witnesses his family being slaughtered by Roman troops in the northernmost region of the empire, is forced into slavery and raised to become a gladiator. When he's brought to Pompeii to fight in the arena, he catches the eye of Cassia (Emily Browning), a thoroughly anachronistic, sassy, forward-looking, freethinking type who finds the officials in Rome to be all uncouth barbarians and who has no taste for such popular blood-soaked pastimes as fight-to-the-death battles in the coliseum. A ludicrously miscast Keifer Sutherland plays a foul Roman senator who tries to come between the noble woman and the slave.As befits the genre, &#34;Pompeii&#34; is just chockablock with stock characters, cheesy dialogue and corny plotting, though the movie does earn a few points for its unlikely and, dare I say it, even quite brave finale.But, of course, anyone who checks out &#34;Pompeii&#34; will be doing so strictly to witness, albeit vicariously, all the death and destruction visited upon the city and its thousands of inhabitants when Vesuvius finally blows its top. Apparently, overproduced, CGI-infested disaster movies are our milder, modern-day equivalent to gladiatorial contests. And in that respect, at least, the movie delivers the goods.There's one thing that &#34;Pompeii,&#34; fortunately, doesn't have in common with those toga-wrapped spectacles of the past - and that is their extraordinary length. So clocking in at a relatively brief 104 minutes, &#34;Pompeii&#34; has at least one thing going for it.", "overall": 2.0, "summary": "Disposable sword-and-sandal epic", "unixReviewTime": 1402963200, "reviewTime": "06 17, 2014"},
{"reviewerID": "A3SS6VRWCTB7V", "asin": "B00IKFSSTW", "reviewerName": "Ron Stultz \"Zenster\"", "helpful": [0, 0], "reviewText": "No more or less than expected. Good special effects wrapped around a very old, warn out, plot. No foul language, no gushing blood, no sex. Date movie? Sure. Viewing with spouse? Yes. Children? No. Guys only? Maybe.", "overall": 3.0, "summary": "Special Effects are Good. All else so-so.", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"},
{"reviewerID": "A1NSDP9YZXLMDX", "asin": "B00IKFSSTW", "reviewerName": "Russell S", "helpful": [0, 0], "reviewText": "We all know the story so I can bypass that because the story seems pretty close to the history. Bravo for that. The actors? Kit Harington as the lead is very low key in his performance and I think that is what was called for as the free boy, turned slave, turned gladiator. Very good. Adewale Akinnuoye-Agbaje as the man he meets at the arena and is destined to fight to the death but become buds, he is terrific, too. Outside of out gladiator friends...not much acting to talk about. Emily Browning always looks too doe-eyed and pouting and not buying her at all as the rich girl who loves the slave. Kiefer Sutherland trying some type of accent and strutting, not a good look. some of the rest of the supporting cast isn't too bad but overall I liked it for the spectacle and some of the story.", "overall": 4.0, "summary": "I liked it but I will warn you", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"},
{"reviewerID": "A3US0VOOEK3VZ8", "asin": "B00IKFSSTW", "reviewerName": "R. West", "helpful": [0, 0], "reviewText": "In Short: Drama revolving around the love between Milo, a gladiator played by Kit Harington, and Cassia, played by Emily Browning, the daughter of a ruler. Class and circumstance keeps them apart but the violent eruption at Pompeii will bring them together.The scenery and effects were both beautiful. I loved the landscapes and the sets full of pillars, columns and statues. Costume designers did an excellent job as well. The eruption was awesome. The entire production really came through visually.Plot and portrayal wise, this one was terribly weak. The love story was built up to be epic but fell short. I didn't feel a tug at my heart or the heat of passion. The only time I got caught up in the film was when Milo thought to extract revenge for the murder of his parents.So I give it 3 stars, largely due to the visual effects, great set and amazing location. A more convincing performance would definitely improve the movie.", "overall": 3.0, "summary": "Lack luster acting, great location and sets", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "ALZK8FWW0SHL0", "asin": "B00IKFSSTW", "reviewerName": "Scott C Piercey", "helpful": [0, 0], "reviewText": "A good theatrical version of the of Pompeii characters were interesting and intriguing. Good action and special effects. Liked the story between the 2 main actors.", "overall": 4.0, "summary": "Good flick", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A2K271L58D0ACC", "asin": "B00IKFSSTW", "reviewerName": "seetheartsoftly", "helpful": [1, 1], "reviewText": "great movie love the film remind me of the old pompeii movie great dvd nice love story and action love it", "overall": 5.0, "summary": "pompeii", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"},
{"reviewerID": "A3PZ0H4BMZOFRT", "asin": "B00IKFSSTW", "reviewerName": "ShowBizBuff", "helpful": [1, 2], "reviewText": "Those who grew up watching disaster films produced and/or directed by Irwin Allen ('The Poseidon Adventure', 'The Towering Inferno') should enjoy 'Pompeii'.  For anyone else, it depends on your mindset going in.  Set in 79 A.D., Kit Harington (\"Game of Thrones\") stars as Milo, lone survivor of the Roman attack that slaughtered his entire Celtic tribe when he was still a child.  Now an adult and doomed to the life of a slave, Milo has learned to defend himself and fight - skills that bring him up to gladiator status, fighting in the arenas of Pompeii.  There, he meets and befriends Cassia (Emily Browning), daughter of the city's highest official and the girl he sets out to rescue when Mt Vesuvius blows, sealing Pompeii's fate forever.  If you can be okay with toss out story and characterization in favor of a colorful, action-packed film with kick-ass special effects once the volcano blows - and for what other reason would you really go into watching this film? - then it's a good ride and even better \"guilty pleasure.\"(from[...])", "overall": 3.0, "summary": "Really 3-1/2 stars, and not as bad as reviews would imply; who'd watch this expecting Oscar-caliber stuff, anyway??", "unixReviewTime": 1400198400, "reviewTime": "05 16, 2014"},
{"reviewerID": "A2G6GBJV6PJ79D", "asin": "B00IKFSSTW", "reviewerName": "Skillet Black \"Three Seasons\"", "helpful": [2, 3], "reviewText": "I had many reasons I wanted to see this movie. I have visited Pompeii myself....and was awed by the beauty and mystery of this city. I spent my youth reading and rereading the accounts of Pliny the younger. (Two letters he wrote of the accounts he witnessed while leaving Pompeii on a ship... that exist from that day( 79AD) to this.) I also taught science and I remember when scientists didn't think his account was accurate as they didn't think a pyroclastic blast could occur naturally in nature. Scientists now agree (with the help of Mr. Pinatubo and Mt. St Helens) that Pliny's account is accurate and that such blasts can occur naturally. Mostly, I wanted to see what Hollywood would do with the blast itself. The story line was...well what it was. A beautiful young girl.....born into a rich family meets the lowest of humans....a slave....who is so handsome and tender..... she is drawn to him. However, as a slave he has redeemed himself...climbed up as high as he can go as a gladiator. This young rich beautiful sheltered girl soon finds herself engaged to a loathsome scoundrel....who is an older rich politically connected climber who sees himself as &#34;Caesar&#34; one day .....and wants a beautiful wife whom he has trained himself. The young girl finds herself in this situation as her father, also somewhat political, wants to make his city &#34;Pompeii&#34; more industrious. However, he needs money and the political backing. Father will get everything he wants.....if he agrees to the marriage of his daughter to this older rich politically connected man. This is the story back drop to the rumblings of Mt. Vesuvius. Meanwhile our &#34;gladiator is doing his best to survive the arena.....then the mountain explodes...sending everything and everyone scattering to find a way out. Of course your rooting for the beautiful young girl and the gladiator to make it out of the fiery hell Pompeii has become. I don't want to be a spoiler.....as to who makes it out....and who does not! The acting was okay......the story line....also okay....THE BLAST WAS AWESOME! You gotta give it up to Hollywood and it's miniature blasters, miniature city creators....along with computers...it all comes together and makes you feel like you just witnessed what Pliny saw! The blast and special effects is what I came to this movie to watch and IT DELIVERS!! You will not be disappointed in the special effects. Any misgivings regarding the story or acting....is forgiven when the blast occurs. I can see science professors (The ones that don't want to bore you to death.) using this film to show what it would be like to be in....or witness a pyroclastic blast. What I wouldn't give myself to see such a thing.....in real life!! Enjoy the flick!", "overall": 4.0, "summary": "A fun movie that gives you an \"idea\" of what it was like 79AD when Mt. Vesuvious blew its top! Literally!", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "AKD0Y0W8NSK0D", "asin": "B00IKFSSTW", "reviewerName": "Striker69", "helpful": [0, 1], "reviewText": "Pointless in the very end is all I can say about Pompeii. It really just seemed to go nowhere while trying to mix the ancient times stuff with the &#34;Oh no, it's gonna blow&#34; stuff.", "overall": 2.0, "summary": "Not Something I'd Watch Again", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"},
{"reviewerID": "A2RLZ2VD2AT8DL", "asin": "B00IKFSSTW", "reviewerName": "Suntsu", "helpful": [1, 2], "reviewText": "Pompeii is a movie about the last days and the destruction of the city by the volcano Etna.Although it is based on a historical fact, the rest is just a story, a scenario that is an amalgamationof various movies, especially a copy of the &#34;Gladiator.&#34;Because without the violence and the fighting it would have been a really boring movie anda box office failure.In contrast with other destruction movies, the destruction here is at the end, and there is not a lotof it time-wise. But the special effects are really good and make up for waiting through the movieto watch it. The tension builds really good and it is satisfying and it is the only reason towatch the movie.All in all, it is not a bad movie and you can watch happily any time of day", "overall": 2.0, "summary": "At last an ancient city is destroyed", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"},
{"reviewerID": "A3ECXMKE2T81T3", "asin": "B00IKFSSTW", "reviewerName": "Tara A. Hazlett", "helpful": [0, 0], "reviewText": "Pompeii was surprisingly a really good movie with a wonderful cast. I don't want to say much and ruin the movie for anyone but it has plenty of action and a little bit of a love story in it. It's definitely worth watching! Especially if you are into these types of movies which I love..", "overall": 4.0, "summary": "Good movie with a wonderful cast.. Worth watching for sure!", "unixReviewTime": 1400457600, "reviewTime": "05 19, 2014"},
{"reviewerID": "A2GS6XMWDUA4KG", "asin": "B00IKFSSTW", "reviewerName": "T. Briggs", "helpful": [0, 0], "reviewText": "POMPEIICertain stories love being told.  And each time we tell them we sit raptured staring at the screen as the latest technology allows the story to be told in even new and more fabulous ways.  Still, we know how &#8220;Titanic&#8221; ends but we&#8217;ll all line up to see the next iteration of the doomed ship.  We also know how &#8220;Pompeii&#8221; ends and each iteration is born when new technology takes hold.  Pompeii was first told using the silent moving pictures technology of 1913 and not retold until the talkie sound version of 1935.  Then in 1959 it was told in the technology of the day, Eastmancolor.  Jump 40 years into the future and we have CGI and digital special effects.  Woo hoo.Ah the good ole days.  When London is still just an outer province of Rome and a sound sleep after a three day hunt is interrupted by invasion from Roman soldiers under the leadership of soon to be Senator Kiefer Sutherland who kills your family and takes you to Rome to be raised as a finely sculpted slave gladiator.  And through the magic of screenwriting the finally crafted gladiator meets a &#8220;Lady&#8221; on their march to Pompeii.  It&#8217;s been a long walk from Rome but now they&#8217;re home at the base of Mt. Vesuvius which wants to be the Roman version of the Hamptons and where Latin has a distinct British accent.  Fill the set with items from a Toscano catalogue and let the fun begin.I do not appreciate gratuitous violence or sex.  But when your cast must include gladiators it must include both and it is not gratuitous.  The violence moves the story forward instead of filling time and it teaches us about the mercy of the different players.Ah Pompeii &#8211; we see her not in her final days as we expect but in her birth pangs as the soon to be vaction spot of Romans of a certain class.  And who wouldn&#8217;t love to see Keifer Sutherland in a role that requires him to actually speak instead of whisper act.  In fact his performance as Senator is pure joy as the cynical Roman investor who has come to Pompeii on a sort of time share weekend in the Poconos where his hosts are trying to impress him that the Emperor would, indeed, be very smart to invest in the soon to be mecca of Earthly delights.  The rumbling mountain that fills the sky is simply the God Vulcan who apparently is pleased the evil Senator has come to spend the weekend.  Stay for dinner and you&#8217;ll be writing a check by bed time, especially if that bedtime involves you whisper acting your amorous intentions towards your host&#8217;s young daughter, the &#8220;Lady.&#8221;  Hospitality is a Roman virtue after all.  And you just have to know the Aristocrat&#8217;s lovely &#8220;Lady&#8221; daughter and the slave gladiator are bound to &#8220;color outside the lines.&#8221;  Yeah that&#8217;s what it&#8217;s called.  And all the while the mountain rumbles.  The smartest creatures in the film seem to be the horses and gosh darn it wouldn&#8217;t you know it; our hot, sweaty, chiseled  gladiator slave is also a horse whisperer.Many dead Romans later Vesuvius enters stage center and it&#8217;s a grand scene as the decadence is washed away by fire and we understand how we&#8217;ve been shown the backstory to the statues of the lovers discovered at the actual site.  Very satisfying piece of work.  Not groundbreaking, not original, per se and certainly not a contender for any award come award season but you know what?  Not every film has to be an award winner to be entertaining.", "overall": 3.0, "summary": "3 DAY FREE MINI VACATION FOR 90 MINUTE PRESENTATION AND FREE BUFFET", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A3U3RFL0XE4F7V", "asin": "B00IKFSSTW", "reviewerName": "THE GHOSTSTAR     ORIGINAL", "helpful": [1, 2], "reviewText": "THE ACTORS WERE GREAT!THE ACTING WAS GREAT!THE PLOT WAS ORIGINAL!THE ROMANCE WAS BELIEVABLE!THE FIGHT SCEANS WHERE GOOD AND ACTOIN PACKED!THE SPECIAL EFFECTS WHERE AWESOME!IF YOU LIKED ,(GLADIATOR) AND WATCH,.. SPARTICUS,.. VIKINGS OR (ROME ON H,B,O,)YOU WILL MOST LIKELY REALLY ENJOY THIS FILM!I READ THE NOT SO GREAT REVIEWS AND WAS HESITANT TO WATCH....GREAT TIME***GLAD I CHECKED IT OUT !  5 STARS COMPARED TOTHE OTHER FILM IT WAS RELEASED..", "overall": 5.0, "summary": "FOR THOSE OF US ABOUT TO DIE,..WE SALUTE YOU !***", "unixReviewTime": 1400371200, "reviewTime": "05 18, 2014"},
{"reviewerID": "AV6QDP8Q0ONK4", "asin": "B00IKFSSTW", "reviewerName": "The Movie Guy \"Movies from A to Z\"", "helpful": [0, 0], "reviewText": "Like Titanic, we know how this ends.The film attempts to develop an interesting love story to the background of Pompeii. Celt (Kit Harington) is taken prisoner by the Romans after they wiped out his village. He grew up fighting in the London arena. He is whisked away to Pompeii years later where his great strength as a gladiator and his ability as a horse whisperer catches the attention of a woman of wealth (Emily Browning). As it just so happens, she is being forced to marry the Senator (Kiefer Sutherland) a man who slaughtered Celt's village. Is there a writer in the house?The love story never evolved. Like most fighters, Celt has no trouble with 12 men, but takes him much longer fighting one man. There are no real political statements in the film. Celt believes his gods are punishing Rome, blah.blah, blah.Will do as a rental.No F-bombs, sex, or nudity.", "overall": 3.0, "summary": "THIS IS NOT SPORT. THIS IS POLITICS,", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"},
{"reviewerID": "A1XT8AJB7S9JJG", "asin": "B00IKFSSTW", "reviewerName": "Tony Heck", "helpful": [0, 0], "reviewText": "&#34;Some prayed for help. Many wished for death. But in the city forever lost, the greatest secret still waits&#34; Milo (Harington) was just a boy when his parents were killed in a raid on his city and sold into slavery. While on his way to the city of Pompeii to take part in gladiator fights he sees and instantly falls in love with Cassia (Browning), a wealthy merchants daughter.  She feels the same about him but they must hide their feelings. What starts off as a gladiator fight for survival against other warriors becomes a fight against mother nature when the mighty volcano blows. He will stop at nothing to find a way to escape the city with Cassia. I have to admit I was not looking forward to seeing this at all. I am not a big fan of gladiator movies at all. I don't know why but I have never found them interesting. That said I did like the movie much more then I expected to. The movie in a way is like Pearl Harbor to me. The first half is a cookie cutter love story and the second half is one long action sequence. I will admit that the eruption effects were really neat, especially in 3D but for better or worse that's what the movie should really be seen for. Even though it's nothing amazing it was much better then I heard and I expected. Overall, a movie worth watching if you want to see stuff blow up and people fight. That said it is pretty entertaining and I'm glad I watched it. I give this a B.", "overall": 3.0, "summary": "Worth watching if you want to see stuff blow up & people fight. That said it's pretty entertaining & I'm glad I watched it.", "unixReviewTime": 1400284800, "reviewTime": "05 17, 2014"},
{"reviewerID": "ABO2ZI2Y5DQ9T", "asin": "B00IKFSSTW", "reviewerName": "Tsuyoshi", "helpful": [0, 0], "reviewText": "This is a sword and sandal action movie directed by Paul W.S. Anderson, best known as the director of the first &#8220;Resident Evil&#8221; installment, and other so-so sci-fi themed films like &#8220;Event Horizon.&#8221; As in these films, there is not much originality in &#8220;Pompeii&#8221; as far as his storytelling or characters are concerned, but the film is still entertaining in its own way, with impressive special effects that are the real star of the film.The story is about a young Britannia-born gladiator named Milo (Kit Harington), who is brought to Pompeii, a resort town for the Romans, just before Mount Vesuvius erupts. He falls in love with beautiful Cassia (Emily Browning), daughter of the city&#8217;s ruler Severus (Jared Harris), but an evil Roman Senator Corvus (Kiefer Sutherland) also wants her. And Corvus happens to be the one responsible for the deaths of Milo&#8217;s family.Well, the story is very melodramatic, but anyway &#8220;Pompeii&#8221; delivers what it promises to do, I mean, the visual effects of the erupting volcano destroying the town. Paul W.S. Anderson must have thought the volcano is not enough, so the film also has a few sword fight sequences (pretty good) as well as a tsunami scene. Keep in mind that we are not watching a documentary.Still, lack of chemistry between the two stars is too visible to ignore. In fact, Milo&#8217;s friendship with his rival gladiator Atticus (Adewale Akinnuoye-Agbaje) is more interesting than the romantic story of the film. &#8220;Pompeii&#8221; is not as bad as you may be led to believe, but the film, I think, could have been much better with a script that knows what story it really should tell.", "overall": 3.0, "summary": "The Real Star Is the Volcano", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"},
{"reviewerID": "A18758S1PUYIDT", "asin": "B00IKFSSTW", "reviewerName": "Viva", "helpful": [1, 1], "reviewText": "A slave falls in love with a noblewoman, the city of Pompeii will be destroyed by volcanic blasts, and there are games and fights and death and destruction.  You've seen it before but it is entertaining.", "overall": 3.0, "summary": "Much like Gladiator", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "AUTBHG6070SL4", "asin": "B00IKFSSTW", "reviewerName": "wiredweird \"wiredweird\"", "helpful": [1, 2], "reviewText": "Disaster movies have gotten way better with improvements in CGI, and this offers a great example.  Tsunami effects, pyroclastic flow, ejected lava, earthquakes collapsing cliffs and destroying buildings - it's all great stuff.The plot, not so much. Gladiators in manly friendship and professional enmity, sweet young thing and leering Roman scumbag - well, they're well-worn kinds of parts to make a script from, but very little I found especially memorable. One thing somewhat stood out, though: the Pompeiians' ongoing insistence that the increasing volcanic activity and earthquakes were nothing to worry about - the kind of natural phenomenon that happens all the time, and they maintained that almost until the rain of fire destroyed the city. It sounds almost like a time-compressed recap of today's climate change deniers and where they might lead us.Adequate commodity entertainment, but little more.-- wiredweird", "overall": 3.0, "summary": "Great disaster effects", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"},
{"reviewerID": "A1S1BJFTA644TU", "asin": "B00IKFSSTW", "reviewerName": "Zalmorion the Fantastic", "helpful": [1, 1], "reviewText": "Surprisingly good movie!  Let's be real, though.  The story is a bit predictable--but not totally so.  The love story is rushed and a bit melodramatic--but not vomit-inducingly so.  Relationships form naturally.  The scenes are believable and enjoyable.More importantly, the action is highly entertaining.  The fight scenes are well-choreographed.  The special effects are impressive!  When the volcano starts its troubles, wow!  You will get to see some incredible disaster scenes.  While you wait, you get gladiator battles worth re-watching.  Good violent stuff.As far as the acting goes, you can expect solid performances.  This is not B-movie trash.  Very well-done.  The settings as well  are beautiful and gritty, very accurate.Definitely worth renting.  This is not a waste of money by any means.  Yes, it veers from history a bit.  But not enough to complain.  Pretty close to the horrors they suffered in real life.", "overall": 4.0, "summary": "Solid Action Movie, Extra Crispy", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A1GD1G8XXPRYQ8", "asin": "B00IKG21F8", "reviewerName": "1337 \"It'll either be night to treasure or a ...", "helpful": [0, 0], "reviewText": "It's got it good moments and b-movie moments. But overall, the movie is gory, and has some original stuff in it. It's definitely not a bad movie, but I don't like gore, so it doesn't suit me.", "overall": 3.0, "summary": "Not a bad movie", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "A2641CJX7J90PO", "asin": "B00IKG21F8", "reviewerName": "A. Joseph Orlando", "helpful": [0, 4], "reviewText": "I can't really give an honest assessment because I shut it off after 30 minutes. But I can honestly feel good about myself for doing so in that I saved an hour of my life from witnessing this sad car wreck of a wannabe scifi horror thriller.", "overall": 1.0, "summary": "ouch!", "unixReviewTime": 1393372800, "reviewTime": "02 26, 2014"},
{"reviewerID": "A3TYC8T6W81DDB", "asin": "B00IKG21F8", "reviewerName": "C. Sawin", "helpful": [0, 0], "reviewText": "&#34;Almost Human&#34; is shorter than &#34;Cloverfield&#34; and has around an 8-minute end credit sequence solely to be long enough to be entered into the festival circuit. This may make it seem like the sci-fi horror film is rushed along, but its fast pace is actually fairly comfortable and it fits the film very well. The film draws influences from some of the most respectable cult classics. The opening credits and the film mostly taking place in the middle of the woods gives it a &#34;Friday the 13th&#34; atmosphere while the music seems like the forgotten score John Carpenter never released. As the film progresses, you're immediately reminded of &#34;The Thing&#34; and &#34;Halloween&#34; during the final act. The violent, murderous rampage also has some better than decent yet not quite great gore thanks to its practical makeup effects.It's difficult to root for Seth though because he's so twitchy. While Jen seems to have forgotten everything that happened the night Mark disappeared, Seth just wants to wake her up to the nightmarish sights and sounds he does remember. He isn't heroic and he doesn't want to save anyone. He just wants his life to go back to normal after Jen told the media that he was behind everything and it ruined his life. In other words, Seth only cares about himself.There's this entire sequence where Seth doesn't seem to understand anything anyone is telling him. He mutters the phrase, &#34;What's that supposed to mean,&#34; several times in less than five minutes. Mark always seems to ask questions without giving anyone a chance to actually answer. He asks a man cutting firewood why he's living in his house before blasting him with a shotgun and thrusting a hatchet into the back of his skull before the poor guy can give an actual answer. Seth is trying to load a rifle while Jen is in trouble. He&#8217;s rushed and in a panic, but can&#8217;t seem to get any of the shells into the actual gun. So he just throws the entire supply on the floor. While the film has several positive influences, the other influences aren't so great. &#34;Jason Goes to Hell&#34; is passable since the acting in that sequel is some of the best in the &#34;Friday the 13th&#34; series, but &#34;Almost Human&#34; is a lot like &#34;Dreamcatcher&#34; at the end of the day and that's something no film should try to ride the coattails of.&#34;Almost Human&#34; would be a decent first film for anyone, but its abrupt ending and familiarities hurt it more than anything else. Nothing is really explained by the end of the film and you're left wondering why aliens have a thing about turning our televisions on, making prank calls, turning the lights on and off, and possess impregnating elongated mouth funnels. While &#34;Almost Human&#34; pays homage to some truly great horror and sci-fi films of the past, it fails to really personify its own identity and it crumbles under the weight of paying too much homage without building its own foundation.", "overall": 2.0, "summary": "'Almost Human' review: Screech and suck to superiority", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"},
{"reviewerID": "A1MECEHZHFE5PT", "asin": "B00IKG21F8", "reviewerName": "Dayna Newman \"Slasher Diva\"", "helpful": [6, 7], "reviewText": "This low budget independent film packed a big punch!The acting was good enough to keep my interest, the story was well put together and executed .A man gets abducted from some other life form and two years later he returns looking human but harboring some strange new habits welding a shotgun an Ax and other weapons of destruction.He kills people or at least it looks that way until he puts them in a gross gooey cocoon like thing until they are ready to hatch and become killers themselves.The gore was pretty plentiful and done really well ,l love the old school practical effects.The lighting and camera work was fun for an old school feel and there were some parts that were pretty scary as well! Very creepy.I think old school slasher lovers and alien abduction film lovers will appreciate this endeavor.", "overall": 4.0, "summary": "Throwback Alien Abduction Slasher", "unixReviewTime": 1393027200, "reviewTime": "02 22, 2014"},
{"reviewerID": "AYG1U47VFZ165", "asin": "B00IKG21F8", "reviewerName": "E. Lee Zimmerman \"Trekscribbler (aka Ed)\"", "helpful": [0, 0], "reviewText": "(NOTE: The following review will contain minor spoilers necessary solely for the discussion of plot and/or characters.  If you&#8217;re the type of reader who prefers a review entirely spoiler-free, then I&#8217;d encourage you to skip down to the last three paragraphs for my final assessment.  If, however, you&#8217;re accepting of a few modest hints at &#8216;things to come,&#8217; then read on &#8230;)From the product packaging: &#8220;Two years ago, Mark Fisher disappeared from his home in rural Maine in a brilliant flash of otherworldly blue light.  His friend Seth Hampton was the last to see him alive.  Now, Seth is having disturbing premonitions that Mark has returned as something other than human &#8230;&#8221;That&#8217;s really all you need to know about whether or not ALMOST HUMAN falls within your sphere of influence.  Now &#8211; if it does &#8211; then you&#8217;re likely to find something worthwhile in all of its low budget schlock.  Will it change how you look at movies?  Probably not.  Will it force you to reexamine your life?  It definitely shouldn&#8217;t.  Will it earn a place alongside, say, CITIZEN KANE as rivaling the best movie ever made?  If you need to ask, then you&#8217;re too far gone for me to help!ALMOST HUMAN is an old-school-style thriller, which essentially means it was shot on-a-budget and won&#8217;t have any of the niceties of contemporary motion pictures more likely known to the masses at large.  The story revolves around the idea of alien abduction &#8211; there are plenty of flashbacks to support that something is definitely &#8216;out there&#8217; &#8211; but, before it&#8217;s all over, it&#8217;ll end up raising more questions than it ever could answer on such a paltry sum.That doesn&#8217;t mean that it&#8217;s poor filmmaking, folks.  What it does mean is that it&#8217;s probably made by folks who have an unflinching fascination with indie thrills, and they wanted to get together for the sole purpose of producing something they believed could stand cheek-to-cheek with the slasher stuff of old.  It does work effectively on that level, but &#8211; as is so often the case these days when young auteurs sit in the catbird seat &#8211; writer/director/producer/cameraman Joe Begos was probably stretched so thin that he&#8217;d never uncover the narrative weaknesses of what he created, much less cared to go out and look for them.For example, he&#8217;s overly concerned with throwing stuff at the wall (not only blood) as one character after another really show up and audiences are expected to care about them.  There are hints provided to the established relationships, but the niceties of developing relationships or establishing &#8216;beats&#8217; are little more than condiments barely covering the meat &#8230; meat that&#8217;ll be sliced, hacked, chainsawed, or space-raped (seriously, it happens!) before the lights come up and the credits roll.What ended up happening for me is that I was constantly reminded of other pictures that had already explored these ideas &#8211; abduction, consciousness-swapping, body snatching, etc. &#8211; to far greater effect in the past; this has the unfortunate effect of pulling me out of HUMAN and putting me back in, say, THE HIDDEN.  I don&#8217;t imagine this is what Begos desired; why would he make his own feature, after all, if all he wanted to do was remind me of other films?  Because so much of what&#8217;s here ends up feeling like it was culled from elsewhere, HUMAN lacks any real conviction to the story it tries to tell independent of those influences.  It reminds me that what looks great isn&#8217;t necessarily filling; rather, it just looks good when all is said and done.Lastly, it&#8217;s never a good thing when a motion picture fades to black and produces a laughable &#8216;that&#8217;s it&#8217; moment.  True &#8211; for those who were watching closely &#8211; there is one of those handy post-credits sequences that adds a bit more to the story; but it doesn&#8217;t add to or reshape the narrative in any meaningful capacity, ultimately being an extraneous moment promising &#8216;more to come.&#8217;I&#8217;ll probably ignore the sequel if it happens.ALMOST HUMAN (2013) is produced by Channel 83 Films and Ambrosino / Delmenico.  DVD distribution is being handled by MPI Media Group under the IFC Midnight label.  As for the technical specifications, there&#8217;s an awful lot of surprising grain in this indie chiller, but the sights and sounds work pretty well for the creative intent.  Lastly &#8211; if it&#8217;s special features you want &#8211; then you&#8217;re about to be thrilled by two audio commentaries, a too-expansive making-off documentary, other behind-the-scenes shorts, a short film, and more.  It&#8217;s a great assortment for those who might be interested in trying this at home.RECOMMENDED.  Depending upon how closely you&#8217;re watching, you&#8217;re liable to find problems aplenty with ALMOST HUMAN; but the truth is I suspect that the makers only intended you to have fun with such a visceral throwback to times when horror didn&#8217;t have to make an awful lot of narrative sense.  No, you won&#8217;t know where the aliens came from or what their purpose was.  No, you won&#8217;t really have all of the answers you want to who these characters are, why they were targeted, or what it all means.  But the schlock &#8211; glorious schlock! &#8211; is lean and mean enough to satisfy horror fans for the bulk of its 80 minutes.In the interests of fairness, I&#8217;m pleased to disclose that the fine folks at MPI Media Group and IFC Midnight provided me a DVD copy of ALMOST HUMAN by request for the expressed purposes of completing this review; and their contribution to me in no way, shape, or form influenced my opinion of it.", "overall": 3.0, "summary": "Throwback Chiller A Bit Too Derivative For Its Own ALMOST HUMAN Goodness", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"},
{"reviewerID": "A27H9DOUGY9FOS", "asin": "B00IKG21F8", "reviewerName": "K. Harris \"Film aficionado\"", "helpful": [2, 2], "reviewText": "The low budget horror indie \"Almost Human\" is not a movie that should be oversold.  When I picked up the Blu-ray with the requisite rave reviews (from Bloody Disgusting and Shock Til You Drop), I thought I might have found a small gem.  Truthfully, though, I think I would have enjoyed the movie a bit more discovering it on my own without preconceived notions.  This little movie borrows elements from a seventies slasher film and combines them with an alien abduction theme and throws in some classic Body Snatcher moments for good effect.  The idea, itself, works terrifically well but I'm not sure the film was always as clever or as original as I might have hoped.  After an intriguing beginning, my interest in the movie really started to wane.  The body of the movie really lacks mystery or surprises, it's just a rampant killing spree (in which a larger dose of humor would have helped immeasurably).  It isn't until the final confrontations, though, that the movie truly came alive.  A couple of wacky moments (alien mating) really enliven matters and caused me to add an extra star to my rating.Slight Spoilers (but nothing that would surprise you if you read the Blu-ray/DVD cover):As I said, I quite liked how \"Almost Human\" began right in the thick of the action.  We meet Seth Hampton (Graham Skipper) as he is driving as if the devil himself is chasing him.  When he arrives at the home of his good friend Mark (Josh Ethier), he spins a harrowing tale of abduction and pursuit.  Before Mark can truly comprehend what's happening, electrical disturbances and a mysterious blue light come to visit.  And before you can say boo, Mark becomes one of the missing.  What happened?  If you expect a mystery to unfold, the screenplay takes us in an alternate direction.  Years fast forward, and Seth is haunted by what happened.  He starts to have strange premonitions about Mark and he tracks down Mark's old girlfriend (Venessa Leigh) to share his concerns.  Mark, meanwhile, has returned (in some form or another) and is making his way back home leaving an escalating body count in his wake.  All of this is so matter-of-fact.  The murders aren't a mystery, what happened to Mark is not really important, and the killing sequences lack imagination.End Slight Spoilers.I will say this, however, writer/director Joe Begos clearly loves this genre of filmmaking.  You could sense his enthusiasm for the subject and how much respect he wanted to show it.  Therefore, when the final act rolls around, I'm pleased to say that the fun quotient goes up quite a bit.  When the three central characters square off, a number of moments made me laugh out loud.  It's fast paced and amusing, I just wish the rest of the movie had been so energetic.  This being a low budget endeavor, the effects aren't elaborate but they are effective enough.  And although none of the actors will win any awards (except maybe a diner waitress who is truly awful in her one line), they handle the action moments well.  I especially liked Skipper.  In the end, \"Almost Human\" is a pleasant enough experience with modest expectations.  It's not a new horror classic, but it has a nice payoff in its ending.  KGHarris, 6/14.", "overall": 3.0, "summary": "A Low Budget Horror Endeavor That Never Fully Comes Alive Until Its Final Showdowns", "unixReviewTime": 1402963200, "reviewTime": "06 17, 2014"},
{"reviewerID": "A9V8Z0OL8I16P", "asin": "B00IKG21F8", "reviewerName": "Tetris911", "helpful": [1, 2], "reviewText": "As the title says, if you seen or enjoyed the underrated &#34;fire in the sky&#34; classic alien abduction film, then you may enjoy Almost Human! Think of it as &#34;Fire in the Sky&#34; except the person ends up being a serial killing lunatic while dragging the dead bodies to a house where they are &#34;reborn&#34; again as an alien trapped inside a human body.  You know how &#34;Fire in the Sky&#34; had hardly any action or kills except for the scary alien torture scene in that movie, well Almost Human is the opposite as this film has quite a few kills with excellent details and not a single CGI! That's another reason why I enjoyed this movie is the fact that the director didn't use any CGI throughout the entire movie! I know isn't that crazy? So if you enjoy those horror/thriller type films growing up with hardly any special effects or CGI like 99% of the god awful hollywood films of today, then you will enjoy Almost Human! It is worthy of a rental and it will certainly make you appreciate the fact that this film didn't use any CGI. Bravo to the director for keeping this film as realistic as possible by using old school filming techniques.", "overall": 4.0, "summary": "If you enjoyed Fire in the Sky, then you may enjoy this!", "unixReviewTime": 1394582400, "reviewTime": "03 12, 2014"},
{"reviewerID": "A32054N42263IH", "asin": "B00IKT36S6", "reviewerName": "Amazon Customer \"newbie wannabe\"", "helpful": [1, 1], "reviewText": "Interesting. An attempt to diagnose psychosis and its origins through mayhem and impulsive violence. Intense, twisted, disturbed. But, like so much of life, only one side of the story. I'd hate to live in a universe based on these types of movies. Everything would be very serious, very grave and your life would be in danger every minute, from sources both natural and unnatural. Life on the edge. What put it there?", "overall": 3.0, "summary": "Twisted. Disturbed.", "unixReviewTime": 1397260800, "reviewTime": "04 12, 2014"},
{"reviewerID": "A3E0ZQNHL0IJP1", "asin": "B00IKT36S6", "reviewerName": "Chimp \"medellinmadman.com\"", "helpful": [1, 1], "reviewText": "It is not too bad till they get to the Titty Twister then it goes downhill a little. Salma Hayek much hotter then the new actress. I would say not to pay for this to watch it. Its the exact definition of average and ok show. I compare it to Revolution the second season with Revolution taking the nod as a little better but definitely heading downhill from the First season. Hope this helps, Walking Dead is a 5 star to give you a comparison", "overall": 3.0, "summary": "Not bad", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"},
{"reviewerID": "A3MDA891A1EPT8", "asin": "B00IKT36S6", "reviewerName": "Chris Winchester \"mikeystoyz\"", "helpful": [0, 0], "reviewText": "I can tell that thought went into this series.  It is like filler between what happened in the movie with few things added in.  If you like the movie you will either hate or like this.  I happen to like it.", "overall": 5.0, "summary": "I likes it", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"},
{"reviewerID": "AIDXQKDZ4EZU3", "asin": "B00IKT36S6", "reviewerName": "David Asensio", "helpful": [2, 3], "reviewText": "it's a weird show i haven't seen any advertisements for it it is one of those stories told in reverse but explanations do come it has only 3 episodes so far i like what i have seen so far this is could turn out to be a hidden gem of a show a diamond in the ruff so to speak i will see as the series progresses so it is worth checking out", "overall": 4.0, "summary": "it's a weird but an ok show", "unixReviewTime": 1396224000, "reviewTime": "03 31, 2014"},
{"reviewerID": "A25CZX9SED38L1", "asin": "B00IKT36S6", "reviewerName": "JLH4", "helpful": [1, 1], "reviewText": "I bought the first episode it was free so I gave it a chance I was very surprised and very pleased my wife and I love the movie always love Robert Rodriguez's films the only sad part is we have to keep buying episodes but we are never disappointed", "overall": 4.0, "summary": "Do not miss this", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"},
{"reviewerID": "A2EKSOLTKBGWTK", "asin": "B00IKT36S6", "reviewerName": "Jraptor", "helpful": [5, 9], "reviewText": "This whole season is a overlong, tedious remake of the movie. Anyone who would be interested in the series has already has already seen the far superior movie. It should have either done the movie in the pilot and given us new material from then on, or just started up after the incident at the bar in Mexico. It has that weird pacing and dialog of a Rodriguez/Tarentino movie, sort of: its too slow. You need to really be in the mood for this type of picture.I would not recommend this entire series as is. It is a great idea, has RR doing the directing, etc. but it doesn't click.", "overall": 1.0, "summary": "Lousy", "unixReviewTime": 1397174400, "reviewTime": "04 11, 2014"},
{"reviewerID": "A16XRPF40679KG", "asin": "B00IKT36S6", "reviewerName": "Michael Dobey", "helpful": [1, 1], "reviewText": "This has been renewed but most of us had to buy the eps online because it was NOT shown on Dish.  This series is basically remaking the modern horror classic , &#34;from dusk till dawn'  and doing it in  long drawn out way.  The first 35 or forty minutes of the movie are now stretched over six episodes.  And we just get to the good part when the series ends! . The part where the female vamp is dancing and soon they will all turn to vamps.  In the series we have more characters because we have more time.  The movie was  full out riot and remains a horror favorite from the 90's for many.  This is a decent version of it But if you might want to wait till the next season to watch it all together as the next six eps will redo the wild second half of the original movie.", "overall": 3.0, "summary": "not a long enough series.", "unixReviewTime": 1398124800, "reviewTime": "04 22, 2014"},
{"reviewerID": "A32TI28F5ZCTT4", "asin": "B00IKT36S6", "reviewerName": "Michael", "helpful": [0, 0], "reviewText": "I loved the movie. It came out while I was stationed overseas so I had no idea on what it was about - I'll admit to be surprised by the twist. So I was very reluctant to even try the series, expecting a cheap rip off toned and dumbed down for TV. But earlier this week I was desperate for something to watch and decided to try the pilot for this series. And got hooked into watching the entire series over four days.The very few things they had to tone down for TV were mainly language and was handled well I thought. The gore is all still there and more. Overall I liked the casting and the variations they brought to the original roles. The one major exception was the door barker at the club. Cheech Marin was so perfect in the movie that any another actor would be a disappointment.The plot roughly follows the movie but with some variations and expansions. Overall I was impressed with how the original storyline was expanded for the series. Once I looked the series up in IMDB and discovered that it was developed by Robert Rodriquez himself it all made sense.This was the second remake this year I liked despite initial misgivings. The Fargo TV series was also amazing.", "overall": 5.0, "summary": "I loved the movie", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"},
{"reviewerID": "A15S34SFWEOYX5", "asin": "B00IKT36S6", "reviewerName": "Mike suell", "helpful": [0, 0], "reviewText": "One of my fav shows", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"},
{"reviewerID": "A0705654XT5UCAYOY7TH", "asin": "B00IKT36S6", "reviewerName": "Mrs. Mitchell", "helpful": [8, 22], "reviewText": "I swear nothing original out of Hollywood in several decades. So you took the movie &#34;From Dusk Till Dawn&#34;, remade it, then split it up into several parts and made a TV series out of it!? OMFG Why!? I saw the original a million times so I'll be damned if I pay for 7-16 episodes of a crappy remake where I KNOW whats going to happen next. These are some whack ass actors too, dude is NO George Clooney & the nutcase is NO Quentin Tarantino  *LoL*....... I guess season 2 will be a remake of &#34;From Dusk Till Dawn 2&#34;  split into 16 episodes and season 3 will be &#34;From Dusk Till Dawn 3&#34; split into 21 episodes. HA! Pathetc....DISCLAIMER: Being that Amazon &#34;comments section&#34; is becoming too much like YouTube comments due to ignorant people with no lives, I have to make this disclaimer. F_ _ _ YOU in advance to anyone that feels the need to criticize my review, as well other peoples review. I turned the &#34;notification&#34; feature off a long time ago because I couldn't careless about anyone's feedback. So your stupid commentary WILL fall on deaf ears. So STFU in advance also. Have a good one : )", "overall": 1.0, "summary": "Really?....Really Hollywood? Another remake?", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"},
{"reviewerID": "A1D4V3UA7YQF7T", "asin": "B00IKT36S6", "reviewerName": "Sareeta", "helpful": [4, 6], "reviewText": "I haven't seen the movie, so I can't compare the show to the movie.  All I can say is the show itself was fun to watch.  I am unfamiliar with most of the cast, but find them to be a breath of fresh air. I liked the storytelling method of starting sort of in the middle of the episode's story, then jumping back to showing what led up to the meeting of the sheriffs and the bank robbers in the liquor store.  Definitely going to keep watching this show.", "overall": 4.0, "summary": "Great start to a promising series", "unixReviewTime": 1394582400, "reviewTime": "03 12, 2014"},
{"reviewerID": "AUA15GOQSMBH0", "asin": "B00IKT36S6", "reviewerName": "Timothy McGivney \"Tim\"", "helpful": [0, 0], "reviewText": "I watched all ten episodes. There are a couple very cool action scenes (both involving Don Johnson) but the rest of the series is very hard to get through. Unlikeable characters and bad writing. Very disappointing.", "overall": 2.0, "summary": "Don't waste your time", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"},
{"reviewerID": "AH3A6NIEHFLZQ", "asin": "B00IKT36S6", "reviewerName": "WkdMan", "helpful": [1, 1], "reviewText": "so far so good ,it is hard to tell since it is only 2 shows in.since I have watched it that far though I can say it is better than most of the dribble on the tube.it does look like Seths brother is going to go in a different direction besides dead this time.I suppose i will find out later.", "overall": 4.0, "summary": "old movie new show", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"},
{"reviewerID": "A1O1ADHL67M5HZ", "asin": "B00IMYS1PC", "reviewerName": "Amazon Customer \"spedteach\"", "helpful": [0, 0], "reviewText": "Love the characters in this show!  Josh Ewing just gets everyone riled up!  I especially love Patrick Duffy and Linda Gray!  Great storylines!", "overall": 5.0, "summary": "Great Show!", "unixReviewTime": 1403222400, "reviewTime": "06 20, 2014"},
{"reviewerID": "A373HKXPLK5B3P", "asin": "B00IMYS1PC", "reviewerName": "Bill", "helpful": [0, 0], "reviewText": "My wife and I both love Dallas. We've watched the show since its inception in 1978. There is always something unexpected!", "overall": 5.0, "summary": "Dallas!", "unixReviewTime": 1396396800, "reviewTime": "04 2, 2014"},
{"reviewerID": "A2UDM58AXW7O3V", "asin": "B00IMYS1PC", "reviewerName": "Cyn", "helpful": [0, 0], "reviewText": "If you liked the old Dallas then you will love the updated version of this. The writers are brilliant without compromising the original. Little nuisances in both set and script keeps your dedication to the original. Can't wait each week for the next one.", "overall": 5.0, "summary": "Can't Get Enough", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "A17BXOU4G49A4M", "asin": "B00IMYS1PC", "reviewerName": "Diligent Diva", "helpful": [0, 0], "reviewText": "The wheeling and dealing and double-crossing amongst these ppl...OMG!! I was so glad to see it come to Netflix since I got rid of cable before season 2. Once I saw season 2, I had to get it here. We couldn't stop watching. Even my husband got hooked. He will watch it without me, lol...", "overall": 5.0, "summary": "Wheeling, dealing scheming and double-crossing makes this a must see!", "unixReviewTime": 1397088000, "reviewTime": "04 10, 2014"},
{"reviewerID": "A1D4DOBOP5OV10", "asin": "B00IMYS1PC", "reviewerName": "Evelyn M. Garner \"whitehead\"", "helpful": [0, 0], "reviewText": "A sexy raw story.. if you like such then this is for you.", "overall": 4.0, "summary": "if you like such then this is for you", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"},
{"reviewerID": "A2F3TZBN4K9YO3", "asin": "B00IMYS1PC", "reviewerName": "J. Johnson \"Bugs Gma\"", "helpful": [1, 1], "reviewText": "Great season.  Lots of plot twist.....maybe too many. But nicely done great job tying the death of Larry Hagman into the season. He will be missed but the legacy lives on.", "overall": 5.0, "summary": "wow", "unixReviewTime": 1395705600, "reviewTime": "03 25, 2014"},
{"reviewerID": "A28ANBQBJUHBQ2", "asin": "B00IMYS1PC", "reviewerName": "Lizs Home Made", "helpful": [1, 1], "reviewText": "I was an original Dallas fan. This show has been filled with ups and downs. I am waiting on the next episode. I highly recommend this show.", "overall": 5.0, "summary": "Love it!!", "unixReviewTime": 1395360000, "reviewTime": "03 21, 2014"},
{"reviewerID": "A16Z5M3JZMIB45", "asin": "B00IMYS1PC", "reviewerName": "LOVE ROMANCE \"ITHADTOBEYOU\"", "helpful": [0, 0], "reviewText": "Excellent acting, great plot, cant wait for season 4. I saw the first Dallas with Rr did think this would keep my interest but it did.", "overall": 5.0, "summary": "DALLAS", "unixReviewTime": 1397692800, "reviewTime": "04 17, 2014"},
{"reviewerID": "A2IN7OTUVDIRXI", "asin": "B00IMYS1PC", "reviewerName": "Megan", "helpful": [0, 0], "reviewText": "The drama definitely pulls you in and from episode 1 your hooked! You start to like one person and then they become bad or vice versa! Definitely not predictable!", "overall": 5.0, "summary": "Can't wait for it to come back on!", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A1NTOTJIA591UY", "asin": "B00IMYS1PC", "reviewerName": "Mother Mary", "helpful": [2, 2], "reviewText": "The younger generation is picking up right where the older generation left off.  It was great to see some of the people from the original Dallas.  If you loved the original Dallas, you will love this show too.", "overall": 5.0, "summary": "Loved the original Dallas, love this generation!", "unixReviewTime": 1395187200, "reviewTime": "03 19, 2014"},
{"reviewerID": "A1GVA2HN1RONVK", "asin": "B00IMYS1PC", "reviewerName": "Nh granite", "helpful": [0, 0], "reviewText": "Great eye candy, great characters and just plain ole good soap opera. I remember the original series so its nice to see the continuation.", "overall": 4.0, "summary": "Always a good guilty pleasure", "unixReviewTime": 1401840000, "reviewTime": "06 4, 2014"},
{"reviewerID": "A2U5WUR3YCVOLI", "asin": "B00IMYS1PC", "reviewerName": "St Johns", "helpful": [0, 0], "reviewText": "Was a fan of several series in the 80's Dallas being one of them.  Enjoy the new cast and this last episode was a nail bitter.  Can hardly wait for the outcome next week.  Thanks for keeping the storyline intriguing.  Have one great idea for a future storyline but no idea whom to write to.  Will see if I can find an address online.  Thanks to all involved with this show.", "overall": 5.0, "summary": "Ejoying the Third Season", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"},
{"reviewerID": "A3D0MT6MH2RTUU", "asin": "B00IOGX55O", "reviewerName": "Amazon Customer \"Computer DOC\"", "helpful": [0, 0], "reviewText": "Excellent documentary on the subject of WWII. Highly recommended series.", "overall": 5.0, "summary": "History's Verdict", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"},
{"reviewerID": "A7CF9ZRZJ3S07", "asin": "B00IOGX55O", "reviewerName": "Bernice E. Johnson", "helpful": [3, 4], "reviewText": "I enjoyed the fact-based evaluations of several of the world leaders during the World War II period, including Hitler, Mousolini, Rosevelt, and Churchill.", "overall": 5.0, "summary": "History's Verdict", "unixReviewTime": 1397520000, "reviewTime": "04 15, 2014"},
{"reviewerID": "A2ZSM4E2QJBTHN", "asin": "B00IOGX55O", "reviewerName": "Catherine T. Burnes \"Catherine T.\"", "helpful": [0, 0], "reviewText": "Vital historical information presented  with vivid photographs. Makes viewer feel part of history or if old enough to have experienced it, remember this momentous time and effective leader.", "overall": 5.0, "summary": "Great Leader", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A1QR41MYUCALY0", "asin": "B00IOGX55O", "reviewerName": "David Seaquist", "helpful": [0, 0], "reviewText": "I am enjoying the series. I enjoy history and learning more about historical events. I am learning more about leaders of WWII", "overall": 5.0, "summary": "informative", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"},
{"reviewerID": "A3T80CIVKOY78F", "asin": "B00IOGX55O", "reviewerName": "Duc Nguyen", "helpful": [0, 0], "reviewText": "It gave perspective on the main players overtly involved in the start, progression, and conclusion of WWII.  I enjoyed it as additional perspective, but it is mostly a review and some revisionist perspectives on The War.", "overall": 4.0, "summary": "Interesting", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"},
{"reviewerID": "A19A8QISJJB28K", "asin": "B00IOGX55O", "reviewerName": "Gae O.", "helpful": [0, 0], "reviewText": "Some interesting footage of the lives of such legends as Eisenhower, Montgomery, Hitler, Mussolini, etc. I did not know much about Mussolini and DeGaulle, so those episodes were of particular interest. The focus on Ike's presidency seemed out of place at first, but I learned so much about his 8 years in office, that I didn't mind. He is now rated #9 among presidents as more archives are released.", "overall": 4.0, "summary": "Good overview of WWII figures", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"},
{"reviewerID": "A3SO0GDQZ8Q8NB", "asin": "B00IOGX55O", "reviewerName": "Garry McGonigle \"GMc\"", "helpful": [1, 1], "reviewText": "Though this series was actually produced in Spain, it seems to have a solid English leaning which made me vacillate between rating the series OK vs. Very Good. The depth of the coverage and history of each remarkable figure is more than adequate but the use of certain historians for commentaries wasn't backed by facts. Try Monty first and Patton second as a case in point. Other than Market Garden, Monty did not commit to battle unless he had at least a 3:1 superiority and his tactical skills can best be termed &#34;attrition&#34;. Rather than concentrate on Patton's tactical genius, the series concentrates on his personal failures/blunders. Keep in mind that this is still a fine series with facts you may not know but also remember that it presents views/opinions that can be troubling.", "overall": 4.0, "summary": "Biased?", "unixReviewTime": 1402876800, "reviewTime": "06 16, 2014"},
{"reviewerID": "A3EDIPCXT15C3T", "asin": "B00IOGX55O", "reviewerName": "Honey Solomon", "helpful": [0, 0], "reviewText": "This series is intended to present a personal glimpse, not an in depth, psychological study, into the lives of those who dominated the stage of World War Two. Even the title is suggestive . . . 'History's Verdict.'  \"Flawed and inaccurate?\" I would choose to disagree. The documentation and references given are valid sources as opposed to 'hearsay.' One may choose to question or disagree but the information is supposed to be 'thought provoking.'  Listen to the details and questions presented  by the narrator. Too many years as a serious student of military history have left their mark. History is a record of the past and can be rewritten many times over as new information is added. We have access to more and more details but accurate/impartial information isn't a 'given.'Hitler, Mussolini, Stalin, Churchill, Roosevelt, Himmler, Montgomery, Patton, de Gaulle, MacArthur, Rommel, and Eisenhower had a single common trait . . . they chose their path into world history. Hirohito was born to his destiny. The episodes are not 'created equal' and still they offer interesting information that has been documented . . . whether the assessment of that information is flawed/inaccurate is for the viewer to decide!Recommended? Yes. The original footage clips, information and conclusions are interesting. The narration is well presented and without the mispronunciations and mangled grammar so common to the documentaries narrated by Drew Crosby for Pacific Media. Worth watching and formulating your own opinion. A simple introduction for beginners and a few details that are of interest to WWII history buffs!hs", "overall": 3.0, "summary": "What was expected?", "unixReviewTime": 1396310400, "reviewTime": "04 1, 2014"},
{"reviewerID": "A3ALJT9CJBMZWS", "asin": "B00IOGX55O", "reviewerName": "Max Mustang", "helpful": [0, 0], "reviewText": "Shallow Bio's to much WWII revisionist histrionics. Lot'a old footage seen a 1000 times.  Not a scholarly epic.", "overall": 3.0, "summary": "Shallow Bio's!", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"},
{"reviewerID": "AXOJOWNLTXQ0W", "asin": "B00IOGX55O", "reviewerName": "wayne", "helpful": [0, 0], "reviewText": "you can sure learn a lot watching this series, and it stays very interesting as well, a  must watch, enjoy ...", "overall": 4.0, "summary": "very good series", "unixReviewTime": 1401494400, "reviewTime": "05 31, 2014"},
{"reviewerID": "AZU0LWSMZTIIS", "asin": "B00IOGX55O", "reviewerName": "William J. Landon", "helpful": [1, 1], "reviewText": "The series &#34;History's Verdict&#34; provides some interesting and little known insights into the lives of the principle personalities of World War II. It seems that an attempt to be balanced was made but may not have always been entirely successful. I liked the idea for a series like this now that enough time has passed to allow a clearer view of these people and events. The troubling part of this particular production is that it appears that for each installment an inordinate weight of the &#34;final verdict&#34; rests on the assessment of a single historian. In an ideal world historians would be totally unbiased and even. In reality, however, historians have a point they are trying to make and this is anything but even and unbiased. I would like to have seen a larger number of opinions used in coming to the conclusions presented.", "overall": 3.0, "summary": "Interesting History with Limits", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"},
{"reviewerID": "ALL0NWP70Y0O", "asin": "B00IOH83AK", "reviewerName": "Denise F. Eliot", "helpful": [1, 1], "reviewText": "Very funny, first-rate British comedy.  Very verbal humor that you have to pay attention to.  As a fan of Steve Coogan and Colm Meaney, I wasn't disappointed.", "overall": 5.0, "summary": "Very very funny", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"},
{"reviewerID": "A1N4MXV65HF7K9", "asin": "B00IOH83AK", "reviewerName": "Elrod", "helpful": [0, 0], "reviewText": "great....Normally when a movie is made from a tv series it's just a compilation of things already done as with Borat, making it boring.ut this while still Alan in new and yes funny", "overall": 5.0, "summary": "ah- haaa", "unixReviewTime": 1396310400, "reviewTime": "04 1, 2014"},
{"reviewerID": "A1KIQ4P4ZW3ALF", "asin": "B00IOH83AK", "reviewerName": "G. Teslovich", "helpful": [0, 3], "reviewText": "The radio station hostage script has been done a few times before - some with funny intent, some tragic. This script started out with a bit of creative dialogue such as the following, which I enhanced a bit: \"Easy way to solve their problems, Judaism & Islam, is to merge the two and they can gang up (declare war) on what they both hate - pigs; we'll call it Jislam.\"Well, from that high point onward it was just stereotypic narcissistic, self-aggrandizement and predictable, railing against the boss, hostage taking.What made the movie really uncomfortable is knowing in the back of my mind all the hostage taking with tragic consequences that have recently occurred in schools in the US and in countries such as Nigeria and Iraq. The plot makes light of all, similar events - difficult to justify a script knowing all of that.", "overall": 1.0, "summary": "Not So Funny", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"},
{"reviewerID": "AFBYQWNOOZRXQ", "asin": "B00IOH83AK", "reviewerName": "Judith E. Oakland", "helpful": [0, 0], "reviewText": "It's been a while now since I've seen it and I'm forgetting it a little.  That's always a test for me as to how much I really cared about a movie; but there were some very funny moments, which is something I really value.  I think it's good for your physical well being to laugh from your belly involuntarily now and then.  The plot is absurd, preposterous and typically British in its irreverence.  My kind of movie.", "overall": 4.0, "summary": "Some Laugh Out Loud Moments", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"},
{"reviewerID": "A36P4BN517L760", "asin": "B00IOH83AK", "reviewerName": "Platinu", "helpful": [1, 1], "reviewText": "It was a pleasant diversion from the usual tediousness of movies in the last few years, but nothing all that special. Worth watching.", "overall": 3.0, "summary": "Not a great movie but it was good.", "unixReviewTime": 1400457600, "reviewTime": "05 19, 2014"},
{"reviewerID": "A3H9JSM1SUTE4O", "asin": "B00IOH83AK", "reviewerName": "Robin Simmons", "helpful": [0, 0], "reviewText": "The first time I saw Steve Coogan perform his alter ego, the inept, self-aggrandizing TV interviewer &#8220;Alan Partridge,&#8221; I immediately thought of self-important Piers Morgan.  This full-blown British farce tracks small-time but infamous radio DJ Partridge when his fellow DJ Pat Farrell (Colm Meaney) discovers he&#8217;s about to be fired, holds the station hostage inadvertently making Partridge the siege negotiator to the police.  Unbeknownst to Meaney&#8217;s Farrell, it&#8217;s Coogan who&#8217;s crashed the station&#8217;s new North Norfolk Digital executive meeting and successfully pleaded the case for Farrell&#8217;s firing instead of his own.The Partridge character first appeared more than 20 years ago as a vain, self-serving BBC sportscaster on the popular faux radio show &#8220;On The Hour.&#8221;  Since then Coogan has incarnated the pathetic, eccentric, self-absorbed doofus on a number of shows including the silly Brit TV talk show &#8220;Knowing You, Knowing Me&#8221; and the sitcom &#8220;I Am Alan Partridge.&#8221;  For those who have followed the backstory, there&#8217;s still a vestige of sympathy for Partridge even though he killed a guest on live TV, had a nervous breakdown in Dundee and wrote his vanity book &#8220;Bouncing Back&#8221; that failed to catch on with the public.  Admittedly, there&#8217;s a lot baggage to Partridge&#8217;s personal oeuvre, but you don&#8217;t have to know any of it to laugh out loud at this stand-alone, surreal, chapter of his desperate, off-kilter life.  I loved seeing Coogan&#8217;s Partridge dashing about in his Kia sponsored car with the garish radio station ad painted on the side and I relished waiting for the moment when Meaney&#8217;s Farrell discovers Partridge is responsible for his firing.  This is not for everyone, but for those who get it, this is pure gold.  It is as the UK movie poster declares: &#8220;12 hostages.  24 hours.  1 partridge.  On air.  Under siege.  Out of chat.&#8221;  A sequel has already been announced.", "overall": 5.0, "summary": "BUFFOONERY AT ITS BEST", "unixReviewTime": 1401580800, "reviewTime": "06 1, 2014"},
{"reviewerID": "A1KMG1AIUS00DC", "asin": "B00IOH83AK", "reviewerName": "The Movie Man \"tenebre89\"", "helpful": [2, 2], "reviewText": "&#8220;Alan Partridge&#8221; is based on a British television character played by Steve Coogan (&#8220;Philomena&#8221;). Coogan recreates the role in this feature film. Alan is a 55-year-old DJ whose small Norwich radio station has just been taken over by a conglomerate. The new owners have brought in some young talent to do the morning show.Senior radio personalities Alan and his friend Pat (Colm Meaney) begin to feel their own jobs are shaky. Comic madness escalates when the station comes under siege and its employees are held hostage. There are elements here of Paddy Chayefsky&#8217;s &#8220;Network,&#8221; &#8220;The Colbert Report,&#8221; &#8220;Saturday Night Live&#8221; sketch comedy, with a sprinkling of &#8220;Dog Day Afternoon&#8221; for dramatic measure. Since Coogan has played the role for 20 years, he completely inhabits Alan and is extremely funny in both his quieter and manic moments.Special features on the Blu-ray release include a making-of featurette and profile of Alan Partridge.", "overall": 5.0, "summary": "Steve Coogan Stars as Quirky Radio Personality", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"},
{"reviewerID": "A1XT8AJB7S9JJG", "asin": "B00IOH83AK", "reviewerName": "Tony Heck", "helpful": [5, 5], "reviewText": "&#34;I'm trying to save your head, shoulders, knees and toes.&#34; Alan Partridge (Coogan) is a famous DJ who works for a station that has just been bought out. When rumors about firings begin to swirl his friend and co-worker Pat Farrell (Meaney) thinks he is on the list so he does the only reasonable thing, he takes the station hostage. It is up to his friend Alan to defuse the situation, but things don't go as planned. I have never seen him do this character before so I was sure what to expect from this. Almost immediately I was laughing and that continued throughout the movie. There is quite a bit of British humor in this but it is more main stream American then say a Monty Python or Shaun Of The Dead is. Coogan is great in this and I wouldn't hate if they made more movies with this character. The easiest way to describe this is like a British Anchorman with the constant over the top antics and the make-it- up-as-you-go feel. This isn't a movie for everyone but I really thought it was funny and I recommend this. Overall, very funny movie, I really liked it a lot, but again it's not a comedy for everyone. I give this a B+.", "overall": 4.0, "summary": "Felt like a British Anchorman with the constant over the top antics and the make-it- up-as-you-go feel. I really liked it.", "unixReviewTime": 1399766400, "reviewTime": "05 11, 2014"},
{"reviewerID": "A3LYFRATW68EX1", "asin": "B00IOH83AK", "reviewerName": "will crow", "helpful": [0, 1], "reviewText": "not so good. steve coogan is usually fantastic. much of his television stuff is off the hook funny and he has a real knack for writing dialogue that's snappy, quick witted and pointed, not this time. this turd stinks up the place and must have had real potential before it hit the fan.", "overall": 3.0, "summary": "1/2 ass", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"},
{"reviewerID": "A28Q2LJTX52PMI", "asin": "B00IP45FAI", "reviewerName": "1farstar", "helpful": [0, 0], "reviewText": "But hey, Amazon only charges $100./yr for &#34;Prime&#34; membership to watch all the trash we wish for no extra fee!This is the last time I'll be signing up for it.", "overall": 1.0, "summary": "Total Trash!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"},
{"reviewerID": "A1I1U2M5KSPY1R", "asin": "B00IP45FAI", "reviewerName": "crosscountryman", "helpful": [2, 2], "reviewText": "Personally, having been there; my first visit was astonishing as a person would never imagine such beautiful and unspoiled wilderness in the State of New Jersey.  I had read Dan Brown's books before going there and knew some of the stories and legends surrounding this pristine beauty.  Brown wrote about his tracker days as a consultant for law enforcement in the Barrens.  Fugitives would attempt to get lost in there and with his knowledge of nature and ancient arts of wilderness survival etc: he was often hired to find fugitives.  He also wrote about wild packs of dogs that roam around in there and his encounters with them.  This film deserves a much better rating than it had before my review!", "overall": 4.0, "summary": "Well done Folklore Piece", "unixReviewTime": 1398816000, "reviewTime": "04 30, 2014"},
{"reviewerID": "AVX30YHHRC3UC", "asin": "B00IP45FAI", "reviewerName": "Michael Cooper", "helpful": [0, 0], "reviewText": "Really bad. Couldn't get past first few minutes.", "overall": 1.0, "summary": "Crap", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"},
{"reviewerID": "A356KJNNX1KM5E", "asin": "B00IP45FAI", "reviewerName": "Patti V", "helpful": [1, 1], "reviewText": "This homegrown documentary is surprisingly intelligent and gives a little more historical leverage to the state's famous occupant.  You can spend your time in a less beneficial way.", "overall": 4.0, "summary": "This homegrown documentary is surprisingly intelligent and gives a little more historical leverage to the ...", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"},
{"reviewerID": "A3ITTX33YHDJSE", "asin": "B00IP45FAI", "reviewerName": "putder53", "helpful": [2, 2], "reviewText": "THE HISTORY OF THE JERSEY DEVIL IS TOLD REALLY WELL. THERE ARE SOME THINGS REPEATED OVER AND OVER . THAT DOES GET ON YOUR NERVES. BUT ALL IN ALL, IT IS REALLY VERY INFORMATIVE.  THE HISTORIAN LADY IS THE BEST SPEAKER. ENJOY. I DID.", "overall": 5.0, "summary": "IT WAS GREAT", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"},
{"reviewerID": "A2NRQ5I8O1ZDBU", "asin": "B00IPQAQGE", "reviewerName": "Amazon Customer", "helpful": [1, 4], "reviewText": "It will be interesting to see where this show goes and how this family will cope with it's move. I will watch more.", "overall": 3.0, "summary": "Interesting new show.", "unixReviewTime": 1394928000, "reviewTime": "03 16, 2014"},
{"reviewerID": "A1332U2QTU7TPD", "asin": "B00IPQAQGE", "reviewerName": "Amazon Customer", "helpful": [3, 5], "reviewText": "This show is alright, the first wife Paulie looks miserable all the time and no fun at all.  Hard to see her crack a smile and when she does it looks fake.  The other wifes seem o . K .  Do not really get a chance of knowing much about this family.  The set up is weird.  Does he only see his wifes alone when they are in bed about to go to sleep. I MISS SISTER WIVES, that is my favorite and they have more personality, and real emotions then this show.  Plus Cody, he is awesome and full of energy.  Five wives they are boring.  Sister wives is much better.", "overall": 3.0, "summary": "five wives", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"},
{"reviewerID": "A2LG275U7BMN19", "asin": "B00IPQAQGE", "reviewerName": "angelicflamesva", "helpful": [5, 7], "reviewText": "I am a fan of Sister Wives and it seems like this family is too (at least Brady is) and have been watching them & practicing what to say on camera once they got their own show. I'm not sure if this was all Bradys idea & the wives are forced to go along with it (which seems the case with most things) or if they all just really were hoping that TLC would pay for some huge mansions like the Browns got (hence the push to move somewhere else from the first episode)?ALL of the wives seem so afraid to \"make waves\" that they are very obviously repressing almost all emotion especially in the presence of each other & their \"master\". Paulie looks like its affecting her the worst, the only time she really had a REAL smile seemed to be when they were drinking, the rest of the time when she does rarely smile they just seemed forced and sad. She may be forced to talk about the good side of her family life, but her anger and depression is written all over her face at all times.It really strikes a nerve with me EVERY time that Brady talks about what a \"beautiful thing\" polygamy is, of course its beautiful for you douche bag, you've got 5 different women taking care of ALL of your children FOR you and \"behaving themselves\" so that they wont be passed over to be the next one to beg at your feet for scraps of your limited attention. Of course YOU are happy, all your needs are being met while they all suffer in lonely depression. It seems like he has all these wives and children so that he has every excuse not to be personally responsible for any of them \"oh i'm sooooo busy but going to school for philosophy sounds like a good thing to waste some more time on\"....seriously?! What an egotistical jerk! He cant even begin to open his eyes to see how much all of these women he says he \"loves\" are SUFFERING! Wake up dirt bag, while your talking about how \"beautiful\" everything is, they are talking about how hard it really is, their obviously painful jealousy, and trying desperately to get your attention ANY way they can think of it (adoption, pregnancy, weight issues, empty nest, holiday party, etc). For someone with so many women in his life, he doesn't seem to get them or want to understand them at all, or maybe he just doesn't want to face the fact that he is the single biggest source of pain in all of these womens hearts (oh sorry I mean ache, blah). Watching him time after time put the needs of his wives last & joking about things that make them all so uncomfortable is just horrible.Like the show is so aptly named \"MY five wives\", meaning its all about HIM and living his fantasy dream life. Why does HE get to be the one who decides if and where they will all move?! He acts like its a vote, but you can tell its not, like most everything else, its whatever will make HIM happiest. Why do a couple wives get to have the amount of children they want but the others have to beg and cry for their fair share? Were those other wives better \"behaved\" so they got what they wanted? Why does one get to adopt while another has to beg for a baby of her own? Why does one wife get called \"beautiful\" every day but the others have to beg for complements (especially the poor absolutely gorgeous full figured one)? If each of the adults have to cook dinner one day a week, why doesn't HE?! And how horrible of him to show up in the MIDDLE of his kids karate event (and the wife & child both seem soooo greatful for that 15min)what kind of father is that?! And why on earth are they all called \"aunt so & so\" to the children, they aren't aunts, they are MOTHERS of all of your children and should be given the name & respect that comes with it! Why is chatting it up with the guys at work so much more important than even remembering to show up to meet your wife for something YOU asked her to do for you?! How dare you take that woman for granted! Get a darn organizer or planner if its that hard for you to remember everything!I feel so sorry for the kids brought up in this environment, no wonder so many of them want to leave and cant wait to go live a normal life. Why would they want to live polygamy after growing up watching their moms suffer like this?! This show is just painful to watch. Yes, the Browns have their issues too but they don't seem afraid to confront them head on & together without obvious scripting. And yes Kody is an egotistical douche bag too, but at least he really does seem to TRY to be a better husband and father and at least he hasn't completely broken the spirit of 5 beautiful women. I will continue to watch only because I will be hoping with every fiber of my being that these women start to stand up for themselves & stop being such depressing lap dogs! Your so much better than that ladies!", "overall": 2.0, "summary": "Depressing", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"},
{"reviewerID": "A1NW04AD2WTUDY", "asin": "B00IPQAQGE", "reviewerName": "Rosie", "helpful": [0, 0], "reviewText": "What in the world are \"progressive polygamists,\" as the Williamses, the subjects of this series, claim to be? Seems like a contradiction in terms.Polygamy is not a progressive lifestyle by any means, never was and never will be. It's a male-centered lifestyle, in which all the women--and, in this case, 24 (!) children--fight for one man's attention. I can understand people practicing polygamy because it's their religious conviction to do so, as the Browns from Sister Wives claim, but the Williamses say they no longer hold true to the doctrines of Fundamental Mormonism, or the FLDS church. So they apparently now choose this lifestyle--or, as I see it, it's too late to change things. So now what?Are they stuck? Must be because what woman in her right mind would choose to share her husband with four other women if it's not something she believes will get her into heaven for time and all eternity? I wonder what this family is teaching the children.That it's OK for a man to have a number of women even though it's not dictated by their religion or condoned by society? (Do these \"progressives\" also believe it's OK for a woman to have multiple husbands?) And what religion do they now practice? Surely, there is no other Christian religion that is OK with polygamy. This family seems a bit of a jumble.A lot of reviewers claim the women, who are all cousins born in polygamous families in the same region of Utah in which the clan currently resides, appear to be depressed, and I would concur. Paulie is lovely, but she rarely cracks a smile and seems to not enjoy being in front of the camera. Rosemary is at least truthful. I like her honesty regarding jealousy and weight issues. Nonie is harsh, but seems bright. Rhonda and Robyn are kind and sweet but they too have that same glazed expression as the others.Several episodes into the season, we haven't learned much about the children, though. They're not really featured in the story lines and no one child stands out above the others. The boys tend to be unruly and it's understandable, as the family has no table around which to eat and mealtimes often become chaotic. Manners fall by the wayside. (You'd think contractor Brady could build one dining hall for the entire family to eat in instead of having to hold plates on laps.)Brady, who does not seem to be all that charismatic or appealing, tries to appease all the women. Of course that is impossible, we all know that. And every conversation when there's a problem or disagreement among the women or they with Brady seems staged. He seems to be reading from some conflict resolution handbook every time he answers them. He always says, \"I hear what you're saying,\" and then he repeats their grievance and gives some kind of wishy-washy answer but that is often just what the woman wants to hear. His responses, frankly, don't seem natural and I wonder if he would be so kind and understanding if the cameras weren't filming.Despite what appears to be playing to the cameras, some of the women claim that he is not always very fair--and it does appear that he has favorites--but how is it possible to love five women at once and be fair to everyone? It's the lifestyle in and of itself that doesn't promote fairness.", "overall": 2.0, "summary": "Dull, for the most part.", "unixReviewTime": 1398038400, "reviewTime": "04 21, 2014"},
{"reviewerID": "A2RASW1UQ22XPK", "asin": "B00IPQAQGE", "reviewerName": "Spider \"spider\"", "helpful": [3, 5], "reviewText": "What a fake boring waste of time.  Seems like its scripted with bad acting.  Won't ever watch again.  Maybe he should get wife #6 and get rid of these, lol", "overall": 1.0, "summary": "Waste of time", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"},
{"reviewerID": "AWBXDSNVRS7C0", "asin": "B00IQ3XNLQ", "reviewerName": "A. Johnson \"surfwood4\"", "helpful": [0, 0], "reviewText": "The show is diverting and interesting but seriously too light weight. Viewers are capable of dealing with much more depth than the show provides. A Brit would say the host is too cheeky for the subject matter!", "overall": 2.0, "summary": "Alton Brown Does Biblical Archaeology", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"},
{"reviewerID": "A3CQJZ8ZA8RFPL", "asin": "B00IQ3XNLQ", "reviewerName": "cat lady 4 \"Bumber's Mom\"", "helpful": [0, 0], "reviewText": "I liked the everyday language used, but I would have preferred more actual field work.  The camera work was jerky at times, unnecessarily so it seemed to me, I suppose it was to make the viewer feel like being part of the action.  It just annoyed me.", "overall": 2.0, "summary": "not enough actual archeology", "unixReviewTime": 1400716800, "reviewTime": "05 22, 2014"},
{"reviewerID": "A2MOIORZE53NL8", "asin": "B00IQ3XNLQ", "reviewerName": "Consumer 45", "helpful": [0, 0], "reviewText": "Different type of a way to introduce the subject at hand. Because of this I stayed to watch this episode but after got tired of the host being too intrusive that he started being the target of interest instead of the main subject.One episode was all I could take. The subject matter though was very interesting.Video quality awesome  Thanks Amazon!", "overall": 2.0, "summary": "Interesting but many times the presentation itself got too....", "unixReviewTime": 1399680000, "reviewTime": "05 10, 2014"},
{"reviewerID": "AJGDRWH36ARGV", "asin": "B00IQ3XNLQ", "reviewerName": "cw", "helpful": [1, 1], "reviewText": "This guy asks interesting Everyman kind of questions about history, without always getting real answers; but the point of each show is much more about &#34;the journey&#34; toward the answers, and the relationships the Naked Archaeologist establishes as he goes are actually the message of the show: inter-faith, non-religious, evidence-based relationships that cross all boundaries. Very entertaining.", "overall": 4.0, "summary": "Diamond In The Rough", "unixReviewTime": 1398211200, "reviewTime": "04 23, 2014"},
{"reviewerID": "A2R404N2I1DOD0", "asin": "B00IQ3XNLQ", "reviewerName": "David K.", "helpful": [2, 3], "reviewText": "This show is poorly made, unprofessional, and boring. The host seems to barely know what he is talking about, and the content is filled with speculation and rumors. Don't waste your time!", "overall": 1.0, "summary": "Boring & unprofessional", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"},
{"reviewerID": "A38IPFFKPERC6P", "asin": "B00IQ3XNLQ", "reviewerName": "Deborah Born", "helpful": [2, 3], "reviewText": "the program was too short, needs to be an hour, and he stretches the science and it seems like information is left out", "overall": 2.0, "summary": "Stretches the science?", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"},
{"reviewerID": "A1L6OEWJF6DUXL", "asin": "B00IQ3XNLQ", "reviewerName": "dokolady \"dokolady\"", "helpful": [0, 0], "reviewText": "Fun and basic education about Biblical archaeology.  The archaeologist-narrator adds a lot of humor and quirkiness to his colorful presentation.", "overall": 4.0, "summary": "\"Archaeology for Dummies\"", "unixReviewTime": 1399420800, "reviewTime": "05 7, 2014"},
{"reviewerID": "ADB69ZTR1E0YV", "asin": "B00IQ3XNLQ", "reviewerName": "D. P. Lance", "helpful": [0, 0], "reviewText": "The show does remove the  veil from the sites in the holy land. I saw a couple of episodes when this was first run. But I missed more then I saw so it was nice to see it was available. Please way to spend half an hour.", "overall": 3.0, "summary": "Well he not naked but", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"},
{"reviewerID": "A1BHHYCGFSPFJD", "asin": "B00IQ3XNLQ", "reviewerName": "Freda \"student artist\"", "helpful": [0, 0], "reviewText": "I have enjoyed the Naked Archaeologist so far.  He does not seem to be very scientific, but I enjoy just seeing the places that are under a dig and uncovering.", "overall": 4.0, "summary": "To See the Places", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"},
{"reviewerID": "A2LVVCZTHYM04P", "asin": "B00IQ3XNLQ", "reviewerName": "George B. Lane", "helpful": [0, 0], "reviewText": "The approach is effective and takes ancient and biblical archeology out the classrooms and sterile digs into an almost realistic view of ancient life. The host is a little silly and obviously slants his presentation toward a younger audience, but manages to balance his desire to inform with his desire to entertain. I could do without the juvenile and unprofessional attempt at comic relief in the introduction to each episode, and I find the music cloying and intrusive, but all in all I think the show succeeds in making history almost literally come alive.", "overall": 4.0, "summary": "A Little Silly but informative", "unixReviewTime": 1400630400, "reviewTime": "05 21, 2014"},
{"reviewerID": "A3PPNNUQBQ2Y0E", "asin": "B00IQ3XNLQ", "reviewerName": "Joe Wocoski", "helpful": [0, 0], "reviewText": "I was pleased to discover that the Naked Archeologist was available on Amazon Prime and I have enjoyed all the episodes. A hand on, crawl on the hole in the ground, and duck reality experience. He actually goes to the sites, and asks the questions that others don&#8217;t ask. The Naked Archeologist explores biblical stories and people through on-site investigation and interviews to bring to life ancient times and places.Joe Wocoski, Author", "overall": 5.0, "summary": "Find out what ancient times were really about!", "unixReviewTime": 1403308800, "reviewTime": "06 21, 2014"},
{"reviewerID": "A39P2I94AC320Z", "asin": "B00IQ3XNLQ", "reviewerName": "Katharine S. Dupre \"Writer & Book Lover\"", "helpful": [0, 0], "reviewText": "It's nice to see a program that actually provides interesting information instead of the usual blather type programs we usually see.", "overall": 5.0, "summary": "The Naked Archaeologist is amusing and interesting", "unixReviewTime": 1400284800, "reviewTime": "05 17, 2014"},
{"reviewerID": "AAD32KTYF3DM0", "asin": "B00IQ3XNLQ", "reviewerName": "Marc W. Gilbertson", "helpful": [0, 0], "reviewText": "I really enjoy archaeology and this show fits the bill.  However, some of the conclusions are based on leaps of logic without enough evidence.  Still enjoyable though", "overall": 3.0, "summary": "Interesting", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"},
{"reviewerID": "A238797046NZPA", "asin": "B00IQ3XNLQ", "reviewerName": "Mary L. Everett \"dressage lover\"", "helpful": [1, 2], "reviewText": "The subject matter is fascinating but the series narrator and travel guide is not.  His goal seems to be to prove that parts of the Bible are literally true in an historical sense.  This is fine but he isn't.", "overall": 2.0, "summary": "This guy is annoying", "unixReviewTime": 1398038400, "reviewTime": "04 21, 2014"},
{"reviewerID": "A3N9MUQZA0GQVS", "asin": "B00IQ3XNLQ", "reviewerName": "Myrna Jacobs", "helpful": [0, 0], "reviewText": "I started watching this on my Kindle at night before I fall asleep.  And I often fall asleep in the middle... not because it's not interesting but because I'm tired.  It's a rather light look at the subjects he addresses but I find it entertaining, easy to watch and the narrator and 'star' is attractive, charming and seems quite intelligent on the subjects.  I have to say that I wanted to be an anthropologist at one time.  ... or an archeologist.  It fulfills my light weight interest in the subject.  Enjoyable.", "overall": 4.0, "summary": "Easy to watch", "unixReviewTime": 1400544000, "reviewTime": "05 20, 2014"},
{"reviewerID": "A2GAD5QCK4N2BO", "asin": "B00IQ3XNLQ", "reviewerName": "sonbums", "helpful": [1, 1], "reviewText": "Loved it... maybe the host gets a little crazy, but I REALLY like this show- am telling my friends about this!", "overall": 5.0, "summary": "Loved it", "unixReviewTime": 1398470400, "reviewTime": "04 26, 2014"},
{"reviewerID": "A1B9B1YZYS3B0S", "asin": "B00IQ3XNLQ", "reviewerName": "Thanks I Needed That", "helpful": [0, 0], "reviewText": "The guy is really interesting to watch.  He has a real thirst for knowledge and truth.  A great educational experience.", "overall": 5.0, "summary": "Great Show", "unixReviewTime": 1400976000, "reviewTime": "05 25, 2014"},
{"reviewerID": "A3OJMDFRJVFIDK", "asin": "B00IQ3XNLQ", "reviewerName": "Vic Graninger", "helpful": [0, 1], "reviewText": "This show makes Archaeology fun.Simcha Jacobovici makes history fun and interesting - he is excited about biblical history and pulls his audience into the fray keeping things simple but not speaking down to his audience. He does not offend any particular people or religion. Mr. Jacobovici presents facts and evidence and allows the viewer to make his or her own decision based on the evidence.This is a very well done series. My wife and I thoroughly enjoyed this series and would recommend it to anyone.", "overall": 5.0, "summary": "Fun and Educational At the Same Time", "unixReviewTime": 1398902400, "reviewTime": "05 1, 2014"},
{"reviewerID": "AVVR73SHTGF2O", "asin": "B00IQ3XNLQ", "reviewerName": "Xrahdio", "helpful": [0, 0], "reviewText": "The show is educational and fun to watch. Hosted by Simcha Jacobovici and Avri Gilad it offers a fresh look at old subjects that is most irreverent and wry. The shows are spiced up with film clips and graphics deftly inserted to achieve a very dry humor. At this they are very successful. I'm a sucker for Jewish humor so during most of the programs I'm laughing. Give these episodes a watch, you won't regret it.", "overall": 4.0, "summary": "Inserted Graphics & Film Clips", "unixReviewTime": 1398470400, "reviewTime": "04 26, 2014"}
]